node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5251969
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\006\323\314=\005\206\303=rl\225>\340\364R>,\206\367\274\342l\227=\240\203#\276O%.\275_-\225=<\376\241\275\240\357\021\273\216\246\000>\256,\313=\214\203\244=}\336\026\275Z=v=B\315\023>\256}\274\276\366_9\275\272\314\217>K7\341\275eNi\276\022\"\034=\277\244P>=Sd=\007\004\327=b:\366<1OR>\361\017:\276n3\250\275\241>\247=\344\315\034\275\006\372\220\275\005TL\274>)\217=\200\031\010>\326K\021\275\205\020H\276\221\215\033\276\341\317T\275#e%\274\332\362,= \315\311=\272H7\276\321[\375=\277\004\301\275Xm\025>\364\035\266\275\036\005\314=\'\235\000\274\326{\211=\210AC\275\225\263\034>\225\262W\274#U\233\275\211\205\343=KMP\2763O\241=\036\311#\276<u\270;\024\255\027>4\210T=\311\202\345=j\246\364\274\030-j\275\264\003\371=\3146\211\275\360Rs\276\235\373\357<\264\340\277<M1\206\275Aj\237=*\356\366=]2\0339\352\225\031\276\332>2\276\016gk;\210Jx<\310\367\237=\236\277\222\2745\237\256\275\021\274A\276\306\021;\276\213\220\003>\322\250\035>G\325\204\275@\337\030=6\3210\276*F[>\321\332\030<p\2208=\204N\373=0\376\273=#_\035=GUi\276c\347\235\274\373z\347=3\037m\275\271BR\276\212\333\267>\271\354\177\275\333\317\354<\211C\223\272\273}\324\273\262\253\201<47\033=\210\206\261\275\350\rn>\314\017f>N\027\232<\017p\026\276\303\323\225\275\000\023\310=\020\251\026=\362\317M\276\243!\230\274\010Ms>\246\306f\276\366\n\363==-\361\275\376\205\005\276.PQ=w\220\215<ZCF\275\3414\026>\305\251\226\275\247\207\226\275\334\033\223\274\212ts\275v\222\n=\373h\325<\326J\035\275z\t\016\275\237\200\035\275\220i\351\275\254\352\033>M\025\334=Ls\010>[\t\242\276k\274\300=\257\242\014>\221=\t\276\010t\t\276\340\006\222\275S\356\262\275\024\216\003>\337M+> \ni\275\210\222\207\2758\217\354\275C\237\337\275O1\225=\225\320\020\2760\242\"\274}\340\215\274t\260\021=\230\263\002>\325\315=>2\2731\276\203\213\225\275zf\220>\341O\361\275\223\237\t>U\300\233\2757\256\207\273\322\360\n\276\"\"\262=\372A\025>6\022B>3\223\t>q\237\231\274\313\014S>\202`\022=\234\033\371=5\352`>N\0149>d\307j>[\316-\276\\V\220\275)\222w>\006k@\276\200\233\353\275\001\210\2749m\266\232\275(\231\362\275\260\n\307\275\272(/<c\365\036=\241\225\232\274i\365\244\2750\221\246=`O\332=8\327\225\275\356\320t>\304\037\251\272\230\034Y\276\t \037\274\252\020S\275\263\316\273\2740]\023>5\202\301=\353\277\351=z\215\234\275D\211^\275\325V\335\275\342\'\257>\tA\004\275\276m\375=\235d\323\275\t\275\253=\374Z@\276\302j\304=%\014\277;Z\023\211>\236\366W=?\037\025\274d\260\330<\004\314\227\275?Pb\275=d^=\334p\331\275\2437C\276\210\204\007\276\300X$\276\273\207?=\271p^<\004\242\243=yV0>$[\014\276ytr\276\214b\252\276\035kY=\357/\341\275\267f\002\274\373\325\335\2755\351\357=\214/\t\276\377S8\276?\224;>\311\267\242\274H\354\315=\373\027#=\031\035\n\276\325uU\276d\002\026>\276\0234>\351\205\266\274_\022\002\275\304\236\322\275\365&*>\245\001\370\275\260\217\210>\325{;=p\025\204<\252\271d;\252\332\346=\263\003w\276\246\3262\275M\310\365=\355\364t>\344LO=\254a&=bOf\275=\275\000>\334r\340\273Yrn>\275\027\177\2753\332(\276\243h!\275\372B<\276\374QL>\335\210.\275\255\257\220\275\370\361Y=\323\232\320=\024\271\023\276>\344\260<G\205\225=\321 !\276\264N\237=\237\311i\276\271\225\322;\241\263_\274\330I\312\275Bm!\276\0005\266=p\360\"\275o\r\214<\277M\267\274\365H\216\275S\033y>\037\330\271\275&\263\207\276\342\265>=\310\017\222>\276\002\367=-\205Y\273\315\241*=\223\t\002=\236\034\210\274)fm\275\330\325\211\274\203\310\362=\273\256\265=\266\215\355\275\r\317c>\210\230\343=\263\307\002=K\371<\276m\273z=Ml\210>\001\304\365\275*\276\274\275=\321\2269\005\324\325=\254\261K>\245\202\223\275\375\tH\276\324\003_\276\206\315\227\275\226\023\036>h\177\034\275<\024.>\322G\374=\227\244T>\362\023\321=\300RR\276\034\305\034\274^%l\274\034\362\016\276\350\373\363\274\262&S\275m\"\256>\220\301\3217&\023\235>\260\224N;\212\277\030\276c\303_=7\234\022>\351\022\007>\270\216\306=J\220\007=\377\022\224<\341Z\240<4PJ\275\221\333H\275\2732\246\275\333\223\351=5y\262=ss\315\275<vo=\023\027\261\275\025@\360:\207w\217:\277)\370\274\212`+\275Dd >\361Hl\276\365\364\341=_\216\036=\277X$\275*k\346\275\210a\007>\207\377\217\274\2050\006>UW\336;\371o\303=\245\t\324<n\277\276>\302%\025>\r\030+\275\222\222\227=\310\235\223\276\360\345@\276_q\005\276\377y\320=\243\201\026\276\202\325+>\231\307\004\275\316Y%\275\345S\300<\253\264j>6\013\352\274\014,\273=\354\214\264=\301\210\361\275\023\320s\274\336*:=X:\262=\024\342\014>\273U\226;\204t\036\276*\253&\2759\242\215=U\354C>L\3213>/\341\350\274\332T\224\275\013G\n\276\023\333:\276\365\361\361\275t|\213=H\354\307=\335B\337\275\037\374\265\275[\253\317=\014{\267\274\207\3276\275\354\036\250>\t6S\276>x\n\276\340\213=\275\326\014#>X\t\316\275\275o2<\021\3004>\202Oq\274\267\325\203\275\204j\200=#\231\317\274\020\324\372=\223\357B<\231h\007\276\305v(\276\2621\264\275X&\216>\'\247\312=\234\265r=\014\352\t\276\334\372Y\276\335\204\313=bT\345=\233\257\227\276\332\2175=\037\"\033\276\327/P\274\337\025\223<\250\247\036\275\264\340r\2754_\353=[\014\331<\030_\005\273;FX\276\007\002!>=\311\222\275q\216 =qn\262=\014\275F=\233\000\317\274\n\213{=a\374+\276\226Gn\275Uk\337\275\020Mu:~I\367\275\2748\217>\235bW\276\003\275\234\275\351j|>\310f\212=~\332\034<w\355$\275\316\272\007>\251\360{=\334\337\003\276\351\320\344=hA\256\275.f1\276b\004\"\273\211Kq>\327N\021\275\370\341x\274i\024\362\272d6&>}d\323\275U\215\030>\275\007\'>\275)I>\r9\273=q\024^\275\247\265\213\275\2150\230\2751%\232\275\221\026`>BIL\276\2453*=\323{\370=\231R\037>\203\265l>\361\372\334=\263\316\313\275;\274\'>\255\253\212=s\273\207\273\371\240\245\275\340_\242=\354k%=\nb\265:\232\374>\275\250\0211\276t\032d=\013\024\033=D\024+\276}?\213\275\312E\264\2750\027/=\3028\034\276\253\360\032\275c\312l\276^^\311\275\016\356\246<\251\335\024\276\352+\210=\237\010\024\276\222Cu\275A\000\216<\3765\n\276t\256\003=B\264`\276\2158\023>\354\"\243=\374\377\007\276\302\214\377\275\214\010\275\274\250\347\300=_\207\256>\343\202\021\276\300\366\264=+\037\312=m\272\r>\357\276\030<\221\034\232\274;$\t\276V2F>\216v4\276\237\201\323\275\032~\003\276\216\261\225=Dd\340\275*<\215>\302\373\035=\247,\264=\270K\217\275\344\221=\276\037\n\036\274\345\375(\275\221|R>v\341m\273\007\376\247\274\353\355U=\216\205Y\275\205\023\215\276\033\216\307<\021\240W\274\356\274\032>c\201\311\275\266$%\276r\335j\275\357*\321=T \245\274Y\337*>\177%\036\276<q\233<\270\014M>F\013E>\004)\023\275!\005#>\244\311E>\247\227\251\273Cb\020\276k\005\'\276\342\177|=\035%\032=L\036\347\275+\360\360\274\250\2766>\201I\372=\326K\212\275/!\010\276\346\024\261=u\207\225\275\010|M=\033U\212=k\320\r>v\353F\275\337\271\235>F\277\223\275q\310Z<\215m\371\275\365b\020;z\204\213\274\000\372\206>*\211a\274\310\002W\276iT\347;\002\341D>\273\344?\276\305\263\351\275\t\016:\276\334BB>\302\333\023>\256mO\275oy\033>y\371\323=\340\2733>\362\025+>o\261H=\213\344\254\275\322\277\260\276*\204\020>\356\262C\275\243\253I>\251\335\024\276\037v\001<\226\335\225>\3706\323\275\304\322\335=\352\240\245\275\230-\250\274\316\1772\276\036;\313=\034)m>i{;=\246\274G\275\261*\230\275\200^\307\273:X\">\"\320\025\276\216\205%\276\003z=\275\214\230\001=wvO>k\317\006=:\337\226\27541\362\275\205\241\014>\226\017\354=\346_\257<\247\343\241\275L\336l\275x\206\021>.\237\007\276\016\236C\276w\227\014=Sy\310\275_\000\020>\327&\017>:\030\034<-\3455>\267\201\207\275m\363\262<}|\020=\267\2067>\216k\031\276\230HK\275\235=.\273n)\335\275\372\022 >\0331\013>Z,\007\275\'3\260\275{\263(>\336\217\242\276\202\271\003\276\363P\007\275B>Q>\301\031\207>\262D\374\275\356<\324=\233g\272=\201\022\034>V\320\211>?\326\336=!\215\222\2751\354\263<a\210\271\275\275\'c\275\031+.\276mVJ\276\250m6=O\355\377<\035\027`\276\374\007\223=\3760\203\276\335m\232=\261\177e\276\325\262\307\274\347\332\350\275\203\247k\274\346\036\224=P\272f=\030\277\033>B[\020\276\242\303\022\275\225\025\334=v-\205=\023\306\000\275\360\017q\2767\257\223\275?\243{\2750d\032<\0040\035\274\027\244\024=\203\324\254<\231\201\355<\300\265\312\275\324=o=\226=]\275\nW+\275:\375t\276S\277-\276\032m\265=\221#\031=v\315\303<\344\3222=\\ =\276\033\207W=7\315\307=}\245\r\273Xs\r>\2705\245=\334\354\352=\354\264\332\274\314\356}>\351\365w>?\3461>\010\224\240=w\334D=\005\272\203=4\2665\276\346\241=>\007\234\255\274\021S?\276\030;N=\343\254:\276)\357\325<\300\236\204\274\017\312l=M?\023>\262\202\363\275q\205\203>\275\"D\276V\234(>\276\232\004\276j\374\334\274\3657A\275E\374\004\276\255\203\370=\373\236#>\345:\"=\336\224\030<$\305.>\002\202\014\276\3524\217>\224\331\265\273\256.6\275\313\372\325;\340G!=;\327O\276>0\355\273a\255\"\275\276\240\274=\301i\252\276\211\374\230=\211\202\n\275\257\207\207\274\360\220\370=\336\261\246\274\220v)\275,\317\004>-.2>\'\231\213\275\323\025\276\275\202\030j<\357y\010\276\374\340->My1\274w\233+\2759\2035\275\201f\232=\256~\215<\004\261\023\276\271\243\241\274\016\322\340=\232\256\002=\332\205n\275\022\032\016\274E\215e\276\344h\377\275\225)\254\275\t\220\035=\257\225\207>\325\3705>\021\234@<\035\357Z=y\022\372\274R+S=\300\255&=u\242:\2762s\202\276e\000F\276=5\245=U6\004>~8\302=\262\0104>\036k\230\2750\032\024\276\021\352\010\275Q\320\004>\'\n\001=F\315\007\276z\203s\274\313\327\035\273\035\251>>z\251@\275\306&c<\341\327\331\275\007\210\253<\373\310\027\276a\305\233\275\341\226\027\275\321\263\237\275\264z;>\323\310\202\276\353#\022\276(\241k\275p\370X\276YWe\276vT\375\275\354\235Z>U\246\234=\217\304\201>}9\020\276M\375\261\275\321\003\363\274\023\030\354=\341\026\340\275\352\021\325\275\nu\301=\023\254\315=oA{=\261p\r\274tR\216<7c\316\274h\020\034\275\271\317(>\344\351\337=\246\t!>J\225\027>\205\312\216\275\226\214\314=\"k\024>\377\232\014>\356\206;\276\020\034\213<?\271z=[\317\005\273H\355\207=GHj\276\336t\217=\221\304\350<\333v\207=\177Hc>\200u\033>\366\322-\276\322\2422\274\232\232\211>\322\344\341=s\211\010=\317\252!\275e\016/=\367\314*\275\303\002f>\267\242\207=T\3340\276kLu\276\362|==\036\362\215=\035\345\202\275=\314\006\275\340\007\247\275\024\226\262\275Q\343\">\371\271\241>XF/=W\340\273\275*X,>r\256\307<\252\337\031>\305oS<\354\366\217\275\277\244!>7(\234\276\211\324\032\275\365z\"\276^K\310<\353Z\307\275\226T\363<_\033\317\271\205\270O\276\220\255/\275}\237+>\246\021\347=\342\207\355=\322\210\362<\005x|<\004M$\276\3447\275>x\313\030\276\333\317\206=\360P\037\276\002!a=\337\372\243>\025\244v\274-#\361\274J\334\344\275O\370\005\275\201r\231<\204F\316\275\3038\273\275(\'\035=\367\253*\275QB0\276\027\017&\276\320~\341\275\020\276\002\275\370\031\314\274\246\354\3608\306\236\211>\267\017z\276H\232\240\275\203i\231\275\317\025\244=n5/>$\307\201=\036\304/>\330\324\350\275\372\320\372\274f~\317=\374\2303=f\037Y\276.N\'=\227\324\013\274\310\257\036>\370\002\020\274\236\"\270\275C\357/\275\231\r\'\275Hr\215=K\337\275\275\037`\334\275\302\'\017\275d\202\222=\257\356$\276y\371V=\376~@>\n\345\034=\206UO>\254s\353=c1Z>\363Gi>\217.\221=\245o\021=dJ\371\275\340.\017>\312\203\301\272\310\254%>\343\371\001>\273\334\236\2719A\200\275\302\305;\276;\030V\276,\357\023\276\306\240Z>\371\252\220=N\3616\275\357\035\274\275\3071\200=\310\305D\275\312J\245=\301:r\276b_&<\242ag:c\221b=\r<\325=\\6\367\274\207\323\n\276j\260\311\275xw\254\274\022\007\034=\251\315`\273\354\036\355\275\017\2201>\212b&>:\217\255=\361\201z=qk\217<\263\277\227\275_m\033\276\337!\365=V~I>\222\204\352\275\006\371\203\276C\374!\275*%X>B\323\201\276)\242\304\275+\036\364\275W\255.>\204T3\275\236E\235\275\355\270\216>dM\'\276\370]\217=d\260S=z>Q\275\242\217+=\240\203j>\356\256\242\275\227\356\230\274\r\252\340\2752\021\020\275\005\346\313\275\t\214\265\274L\"\222\275\304j\310;E\352\320\274:\245*\275\274\273>\275\255\3146\276\304\357\315\275\027f\254=\216X\006\276\274O4\276\\\372c\276Pb\225\275\232V\221>C\023\355\275d\355F<\331\345\260\2751\032?>OaP\275\211\233\256=\354\002\234=1\372s\274\221\272\222=\217&\036=\033I\241;\204\303c\274\036Z\346=[\004\224=\216Y\026\276\226Y\203>\026\255\365=>\036\346\274/\023\013>n\216D>M\332z\275,\262\264\275&\010f\275Bt\257\275\241^\223=\324\333\205\275\223\\\253=8\241\375\275\365\310+\276\320\275\262\276_P\235>nsA\275C\310\317\274\271o\240=~\303\270=\207\242\003>x\246\023=\317\021\216>\363\305\322\275\352\024&\276\350M0>\330\246/\275\337o\003\275\365\266}\276\033\373-\275\361\001\266=/\177\302=\373mM\275\370$\210>\024;\304\275L\355E=4A\374=rg\344=w\240\242\276 \243\027\275\237\\\223\275I\333G=\273\222$=*\243\201>\260\212`\276\271\330r\274\313\250\370\273\345\361\005\276\3438\010=\271j\014<\255\306\264={\036\340=\210\r\020>h\311~=\276q\330=\327\023\210=\341:\264\274|Cb\275\347\252Y\275\325;\">\001\273\014\275\333\003U>\303&\322\276\004\035\2239\274\326d\276\2049\005\276\205\310\016<S-2\275ZRk=y\301\275=\202\301\376\274\235\262\263\275\273\236d=}\317\327\274n\277\257=\022\003b=`\002j\276\224\371\246\274\315M\220\275\022\326\337=D[m=\364Rl<\223Z9>y\200%\276\264d\020>\253br=\364L\243<\273zO\275\217\014\003\276At>;\276\034\202>\244\277\004\275\001Q\223\274\002\306\237=\365\374\276=n\266\302\274lF\252=\001_\213<\307W\317\275J\317\226\2755;\354=\275\365\374=0\317\207=\356\307\307\275\244\366\240\275\311t\276\275d\303\207\275Q\031f\275\375\363P>\020\273\237\2751[\"\276\320\343\017\276\215\301\310=\323-\321\275wm[>\310e\361\273\236\233\212\2767q\206>5I\304\275\027EF\275\246w\'>\03309\275\005\236\261=~\254\362<\346_\026>\236\273T>\311\271\207\274\273%\221\275\261c\324\276\332\364\032=\220s\264\275\312\364\037\276\010\306\022\276\\a\007\276\017\352b=\306\264A\276\321 _<\244\2330>\010\317\336=\375X\213<\233\304\310\275z\304\342=\272.\215\275\207A\262\275\242\255=>0\302\r=W\314\221<d\222\233\274"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
