node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 587483
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\231\205\374\275\372\325F\275c 3\274\207\2104\275\360\3551\276T\312\002\2769\347\353<\366) >\033(0=\222\247b>\300\t\344\275\227\3359=\263\343\343;4H\365=w$6>\035\313\223=\024r\025\275\307l\016>\325\3545\274A>o>\222\374:\276\360\027#=\270\2400\273\325b\204\275\013\263\273\275-\tk= S1\275\310\377d\275\')\337=\'t\023>E\326w<\ty\277<\321\0270\276\r\351J\274\036\233)=\336\020\021\275\277Xe=\345\316\023<\230\310%>\372(8\2766\337\">\255\023*\274C\201\325\275\206\215P\276Gi*<\014\223\263=\210e\355\275\340)(\276n\261\265\276\276\262\035\276/<\004>\223&/\276\272\315!>\270\027\362=\355\332\260=\020#e>\344\300\362=\230\247\332\274\322\024\340\275\337\032\230\276\215\206\334\275r\034\225\275W\210\300=59\375\275Hga\276\357\371\223\274\267\360U=x/\264\275O\360<\276i\205\256=\310\353?\276\342\305\320\2722u\341\275\314\004\214\276\244\213\277\274I\2534\275\360d\240\275\010\000H=zg\311=\260\233T\276\244\216D>w\351\036\275<\330\307=\317\216\335\275\231N\300\275pt8<!\355@>\251\217j\275j\222\221=r\022\276=w#\014=\356\234[\275\237\362-\276\255<\334\275::\034>\016\365\263=\242\255\343\273\3527\376\275tH\267\275\333B\323=;\216J=\222\037\241\275#\263\005=o_P=\371\213->\250\020\351=ud\204=\306(\010\274\035j\027\275k\211}\276\254Q\324=\254N\345=\\~\240\276P\367\230\275\302\301\273>\311\245\361<\234m\203=\355\tN\276\316\036\264=\357\215\243=\302\3636=\033\010+\2758*\024=~\321\'>%5W:\001+\260=L\356A\273\033\264\001>k\t\315=\340Xz=\320\234*\276\0327\204\276M\270\377=\332g\037=\002?\233\275\252\2137>sm\306\275\361\235\014\276\267\301\333=\262\377/>\320\315&:\302@\026\275\277\0331>\277\253\271=H\002\202=\347\320\210>RmY>\252\031\035\276x\365\374\275\007\270\200=\007Z\313\275\236\033\177=\244\232\">\360O\200\276\3733\346\274\255\213\322\274\207:V>E\267\177\275\331O\235\275_ [\275\031\376\210\273\232\202\001\276\315\233\255\273\312\014\250=h\264\200>v\226\317<zAt\276\217VO\276\316A\007\275\2145c\274\253\275\242=\267\301\273=?\273\271<\261n\007\276\031\353{\276W\344\274;\331M\344\274]\371\214\275-Do>i\343\322=\254\025+=\2237\177<\241\254\017\2757p\255=?\302\017=V+h=9\317\306\275x\333\257=\271/W\275\237!B;4Z\362\273}-\325\276\255e\216\274\013\302\205<U\376\373=\326\230\340<L\367\322\275\004\351\311\275\201\352\257<\344\311\004\276>\321G>m\243\350\274\3175.\276D\3026=\204-\016>\207g/\276Yh\005>V?\255=Q\r\366=\275\222\200>\344\235\255<\005\250m\275\352\267\027=\375\237%>Y\271%>\301@\252\275\315.\355=\002\330\221>\202\3536>\031\260\256\273c\354\232\275j\365\022\276b`%=\026\026\263=\313~\356=J\270!\275\327\325\025\2765\360\371=\260\337,\276\201lM>\016\237\022\276A9|\275g\333\272<ff\254=)\004\025>\362\240\314\275\017\335\272\275[\362f\276\031\370P\276\334\321\260\275\252\307\355=J\303{=Or4\2762\310\230<\3743\024>P4!\276<F\031>\322n\202<z69\275\037cm>P\226\036\276\n\273\t>\253X\220\275\006M\213\275\224F:>Z~\362=7Rr\274\031\216i\275\3138f\276\037\243\243=w\235\253=`\317\346\274]L~<\010\367\224>\303\235\342\275\207\347\235=\241\032\207\275n\270\243=\022\tW\274\352<\024>9S\013\276\210\311\002>n+&\276\340Gx>\336\032\202>\263\\m\275\216\222\257\2750|\245=\201\241s\2731Zh>\305X\371<\243\232i<7(\\\275\200\252L=L3@;\024\202\031\274u\254\317\274\004Ju\276\367\317\214;\316\221\214\275\336o\330\275\241G\236\274^\332\242\275\355$\r\272&\335\000\276\022\325\217\276\205\025@>\332\241\217=\211v\313<\"Dc>\rT\016\276\021\270G>\276`\001\276\3378\326;\316\257\000\276:\360-\275\345T\221\276h\243~\273O\354\251=\325I\253<\205\351\210=xW\021\276\274k[\276\243\347\206\276l\014\254\275\231y\212\275\264|\334;\001\337\343<\301\215\313\275\035\217\004>\261\326\000\276\231s\305=\330\243\275\275O\360\031\274\267\212\037>\334\002\271\273\245\2071\276\312\225\016\276\314v\301\275N1\213>I\205\237\275\316\374\035\276\321(\253\276\242\013\375=\230#\221\275\211\226\270\274\026\362$>\375\236\315\274\313\226\301<\320\214\350<~C.;0)\374\275H(*\276\323\034\355=\245N^<\370@\336\275\277a\275=\017\333\340;|\n\204>\310\000\260<\3426\225\275p\377E=\230\345:=\272\223-\276\202h\214\275\262m\036>\363\356\236<\2530`<\3136S>\376\243\260\275\020\356\241>\031\205\264\274\342\223\216=\213\n\202\276\007AO\275.K\211=2\365\345\273\374)\013\275W\304\031\273\362\255t=\255ov=r\201`\275\360\237l\275\310\276#\275\217\274/\274\344\001!\276m\017\256\275\\\330\352<\2716\350=@\034\026\276\251\323\371\274f\353\274\274#\244k\276\342\363\216>\242)&\276Z\354\314\274\337m;\276\rJ]\276w\225=>Kn\377\275,\276\016\276!\227\355\274\\\375]\275\244\234\303=\n\324%\276\2053#=Z\347\237=\356\303\320=\274\255\226\275W.\326\274F\270\311\275\333f]>\234\373\244\275\t9\t\275\261c->b\357\270=)9W\276sx,\276\202\365\331\275p\3575<z \272=\234\345r=d5\214\274Dz\251\276\245}\356<\021\253\245<\034\001C\276\362%\001>\217l\226\275\244\313:\275l\240\273=\306\026\027;\255\257\312=\n\347\014=\257\345+=\305\274\332;\260\347\356\275\014\360:\276\273\313\273=\222\2615\275\331\214~\276Me4>F\010L\276\3519\207\275G\302\314\275\260sx\275%(\325;\360t\262=\375\3541>\267\024\213=\352\276\231\274\316\217\210\275\333\313K\276\352?\316<=\204\247<\331\031\222<-t8\275\001\001\353;u\311\276\276\332\230\035\274\027\016q>\352\351n<\025`\206=\327\340)>\222\342o>\022\275\271;\236\001(>F\0209\276\226j/\276\233\365\347<\211\200\032\276V\257s\276\001n\215=\006\244\224\275\205sW<\337\321\275<\255\330\014\276\202\202\341\275\001\271p\275\004\305\026>74\327=\266\267\240\276\355\365\216\275\323\004\345=J\212\357<\356\371y<T\231\000\276\022a\317=\211\327\273\275\317\013\351\274V/\364<\241iG\275\226q8\276\310><>\010\010J<\351\216\311<X\2328\276\325S\002\276n\306\226>\375\362\235=^{\031>\271\347\243;\257c\226=~\267\323=\024\036P=;\342\030\275\220\031l\275n\271\276\275\352\217x\275LSI>\237\310\257=e\360W\276F\376\373=S\nI>\025\202\214\276\201\320\341\274p\370\242\275\337\240\235\276qj\377\273\313\217\227\275\373\221\227<\342\220\376=\252n\206\2757C\016>18\265\275\206|\031\274\257\177\247\275\265\203\000\273\267\265\276<C\261-;\017\377.\276T\305\\\276\375\227\016>\232/\n=\332#\205<\177[\242=\277_\010>\361}O>\247\210\361\275\214\034\343\275,j\014=?\316\360=\003\234\236;\236\216$>\031X\204>\217W\362=\242\000\360\275\341\256v\275\305\347\242=\376\233\377=\356\310Y<\242\213\250=\031o8\2764\214\202\276\274|7<\207\221\017\276\303|\206;\007o\374\275jAm;-\266j\276q\334E\275\205\243\221\276\321\232>\275b[\261=x<\337\273=\nU\275\003\330\342<\355\n0=Y\032)>\031_\262=\2013\005>\320\273\333\274\231\221\237=5\256M\276\316V\307=\022\334\344=+\201\202\276.\231\232=\333A\346=\352\016\247=\205m+\275\240\036#>\374\302x<\030U\003\275\026\326\204\274\365\363\225\276wN\230\275Q\370\n:A|K\276\207]-\276b\340g=\356e\313\275Gr\005>\014\030\'\276SwW<\303\210\302=\351\263o>\002\022\213\276b\264\035\276\342G\213=\235\020=\276\307\256k=a\357\014\275]0`<\020\356\235=\352\331\'\275\034\030u\275\350\002\006>\2244\231=\034\254\375=\0300P\274\276s\033\275\234\360\234>\3144\373\275m\324?\275\265W\000=\234\334\005\276\334\303\213\275%\251\235\275\332\223\232\275\344\213\241\275-\003\331=ZE\222\275\004\250\300=\"wu=S\313\030\276W\365@\276\330t\203=4nr\275?oF\274\231\203\312\275QQu<\224\r\337=\230&\322<\'\246v=\233\244(\276 \316\264\2759|\300<fj\212=\253\366\375=\344\211w>c<D>\025\350\026\274\314\364\324\274\341L\201\2742\321\322=\262JB=\021\206\'>S=\021>\001f\264:\205\376E=\372\346\310\275\362\266\331=\364\336%>\365Kr>#C\211=)\345l=8N\306=\345l\240\275\027\360\270\276/K\203\276\374b\037\275\243ke=\331Uq=b\037\262\276U]\300\273\3375\021\276OT\014>p\316\204=\023}\007>)Ty=\256\251\177\276:p\306\275\307\262\214<\265\275\r\276=\240\271\275\003\200\244\276\276\2013\274I\206]\276v\024\021>\207`\036=\273\025\017\276\250*\203\275\333\313\224\275\346q\267\275\022g\231\274\375b\252<RjO\275k\020\365=7\355Y\274\274S\234\276)y\301=%\252\362=\036e\014=\325\013\035\276}n\215\275\312\035&>\300\030O>\316we\275\007\334i\275\010W\347\275\035\216_=2\216\325<\014L >5\010\t\276\260\224e\275\\\351\316<\244\374\307\274\241\214\010\276\'\006\234\2753\320\\\276/\202P>\355\3058=\254\260:\276=\\\240=jZ\371\273;sv=\231\207\013>\316\r\325\275_l\256\273\335\213\322\275G7t\276\310\371\310\271\n\350\225=8R\365\274\311AG\276\232\037*>\311\220\231\275gDr>Zx\t=K\002M\273}\324\t\276\312AM\275^\255C\275\340\303\225<\374\250\200>\247\256\253\275r\007\006>Z\333&=+\331\035\276\273x\013\276b\027\226\2755ky\276\230(\002=o\3660\276\257jW\275\221G<>}\302\305\275\345\353\312\273m\217)\274\351\016\007\276Qz\332;%#\253\2759$\307\274\177@_=\2067\316\273\235l\364\275\323\214D\275dY\237=\033\260==\306\026\031\276\321\316\215>\350O\270=\311d\204=\026\352\243>\243*\263>\276\354\366\275b((<\364\276\247\275\010\013\370\275\310\211\313\275\254bs\274\237\3534\272\355\021\267=\026}\360\274O)8=\010\023\270=\271\371\213<\215\376\235\275,\276?\275K\351#>\351>{>d\356X>\027&\204\274NR\366\274\007\215\211<Ig\230>\341,\246\275\310\035\360\275\374nl<\241c\346\274\235\212X\276}v\271\274\354\272\305=1\345~\276\270\232n=P\240;\274\312O$\276e\270T=a<\216\276\361\221\357\275\207vx>\006\314 >\335?\357\273^\237\216\275{\211r\275\266\215E>\206\236\321\275D\227V\276\r\307!>l$\370;z\322\343<\263\352\216\274,\217\000=\330\326\037>o\353a<!B\001>\243\323T>\311h\226=\361\003\205>\367\366\005\276\220\337\350\274\253\273\367\275\377\344\346=7\320\370\273=[\245\275\210\n\256<\221\370x\275#\245\221=\035\377\305<\306.$\276V\315\200>\261@\224=\221\2545<uG\230\275;\3169>ys\373\275y\355\355\275\030\236\332\275?0\371<\315\225 <E21>\026\252-\275\003M\343;\241q\347\273\226#\n=1\246\256\276\033>\245\275\317\255\030=\036\373\030:\342\252\343=\010I\256=si\205\276?\010Z>\305W\315=\210\310\332;\200\215\014\276\317\333A\2757\267\006\275=\311\307=a\2212;\313\213\235=\320\365R=LyC\275\332\350\r<\365\360\t>\251\354\243\2764]E>\022\377_\275(.=\276\205!K=+;\262=Dr?\275\355\371\204=\346}i>\327\364-\276K\022~=\241\207]\275>V\302=\223\311r=\236\356\206\275@\363U>\201\266\221=\376O\325\275\216\212\001>y\222\302=>\353O;\016\032\035\276\274\226\205\273\226\270\315\275)o\342\275\354\220\361=\375r,>Wa\300\276\310\020>=i5\343=x\262\033<J6\257\275\256Yp>\315>\253\275\006c\334\275\370\033\275=c\'\242\275\226o%=\257JT\275\006\371h>\227\226\247\2742B\032=\256$e\275oW\354\275J\307\275\275{.\255<V\274\234\275\251t\217<\n\301(<E\233\242=\270\024C>\3655\302=\340\350(=#\203\t\275e<\363\275\266(H=\3542\243\276\374k\324\275\3614 >\006\010\026>\027\350\357\275n\n\326\275+\357\300<o\310\215\275\232\212\203\276\231\242C>\246\017\325=]\220\003>\320\377K;\244\212\222\275;\373;=}\002\003=\344\341\032\275\n\346\266\274\314\352\340=#k\306\275\022\321\033>n\264\037>\010\305E\276\363\272\004\276\024\024\214\2756\345\336=\206\304\224\276`\224\017>\214q\351=.\356\027\276\376\0021>??\031\276<\026.\276\364\274\260<\222\016\376<\354}\000\274\033A?\275\263\244\365\275\021mh\273\022[#>Om.>\035\367\026\276\242\204b\274\207\013W=\276Fp\276\334\341\205\276\271q\207\275\321\330\313\274\330\243\271\275\361\314\345\275]C(=\315\013\211\276\237;,\276\313\346\315=\230\003\344<Q\234\240=\235\245`\276B\273\024=\307\330\234>6\241\212>l?\233\275\'\302\006\275K\225\313\274\217\305\224<\001\252\251\273\"a[=\272\232\330\274v\214|>\005a\030>5\341 \276\n\343\251\275U\375\260=\346\022\201\2750\223%\276\365*\230>5l\355\275\265\331b<&\013\244=d\335H;\374\031\014\2756\002\014>\021\021C\272\365\006\001\275r,\036\276\273\006\316<R\306\276=\372\307\271\275T\214\332\273=\335\326\275+\336@\276\3219\351=\244\205\247\274\342R\005>\013\323U=\325\321\247=\004\202R\276h\242\006>\2735w>\367\036\244\2759a\312=\276\033\021> \0346=\223a\250\275\272/\313=&\202^>m\352\223<P\336c\275)*]\274\017\340\246\276M\304P=B\237\341\275\237Q\005>:\225\265:\364\246v\275\353W{>s\022\n\276\345\373<\275{\210\355=`\'%\2757\tw>m\251+\2758>\367\275\037\226\203\276\030\024\252\275\030~.\276\313\274t\275\361\227@=\255@\324\275l\014s\2758(C>\366P\352\272\nC\236\272wt\263=\017\362\021>Y\260\032\276lN\216=}|\344=T\376=\276\237K\236\275/#\315=\243\033\037>\250t\247<\325\336X=\314\322\001\276\316\177\332=$\t9>\0268>>\342\034\265\274PB/\2764v\231\275I\220\'\276\342b\017=\231\020~>{c[=W\201Y\2752\233\237=\255\376\320\275)\333 >%^B\275<~\033=\347\277L>3\222\267<\224X>>\257 K=\006\261\023\273m\312\267=\214\300\014>q\204\307=3\'\217\274A\234\335<\017\257\003\276`Y\300;<\230\230>E\376\375\275\352\255\265=\372\237\226=\224\301\022\276<_E>>\356\371\275\345\276\230=\235\314\025>B~,\274\353\340\005\276\241\007\235\276R\326@<\"\0247\275\233gR\272x\327E>$\343\341=L\235\256\275\252\252\007>\244\360h\276\260\307\217\275i\253\345\275I\307\232\275Jbd\274\247\343\205=y\001^>$\374\027<F\246/\275b/u>\372 n>\361\354\225\275\270@#>?\206)=Y\244\023>n5b\275\350\354\324\275%r\226;0,\364\273><l=\326^/<\027\213D\275\252\023D>\326\263O=\367\202\241=UjK=\372_\014=:\337%>c\346\010\276h\230,\276)\370\210\276\262\t\032\276\370\233\323=\350\204R\275\277\261\036\276\256{}=Jn\266\275\355q@>\205\351\237\275@\207\306=x\272\201>\350K\035\275\253QM>\177\013I=R0\201\276\000\014d\275\260>\001>\357m\354\275v\266w\275x3E\276f\371\017>H\306\310=\251\323\254\275\005%B=\252\302\366;+K7<p3\017=4\300K>\233&C>dW\363=\244\177\230\275&\211M;>\240\007\276c\000k=\007.\316=O\3255=\350N\241\273[\305\252\2768\2249\275%\373\020=\207\357&>T\006\347\2758\346\330\275\307n\n\276\327\007\001\2760\227F\275\314\245\232=K.y>\363\304;\275)|\353\274\364\272\324=+\334\207>\363\253\014\276\317\226\033>\353z\013<Z\006@<3Ml=\265\271$>\374\255Z\275r\370\225=\033\224\226=\273\007L\275\367|^>t\372L;Y\001N>%{.\275\035K\265\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
