node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 2232441
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\200\0105\276\356q\024\276\226=\212=\314h\206\275\3001\010>\262\332\017=\241\016\224=K\032M\274tY\243\275\261X4\276\016i\373\275\374S\321=\034\333\360=\236$k\276fe\362\275tW\345\274\310\222\333\275\007\317\037\276F\013\274\276\t;\032\276B\027\314=4\3753\276\214\370A\275kZ\330\2753\023\265=\224\030c=r\360\301<\024\274\324=6\327\204=\033]<\27671\260<9\332\207>\3376\361=\020\366\016>&\037[\276U\367\242=\177[\322\275\253R,\276\244\316\247\275q\242k\275[\252\325\274(t\216\275\343<\315\275F\031 >y\177\254\275@\202\271\275=\327\033\276\350\341\334=\242\264b\274\366\337D=h2v\274\354\200 =\376\212\315<\014\200\212>]\214\265\274\330\370\017\276Q1\227=\366\235f>J\032\345\275\001:\204;Dw9\276\222\300T=\014\272[\273\246xC\274\307K$\276ey\347\275\322\253\222=,(:>zx\014\276\221\250\274=\351\324\357\275*\231\337\275\300\307\227\275\001^\004\275\331V\261=.\320Y\276>\222\205=#\256*\276\332\220T>\177\234\"\274\264~\023\276\234\376\256\272\314\350\332=\250\014\343\2748\321T\275\245_\313<`\264\000>T|\010>M\312/>\204\275{>I\017_\275*c\007<\221g\316=\362\"\022\276 4\352\275(\023U>\275\252\025\276\362\230->\212\023;>l\377?\276#\265<\273\317\357;>\241(\001\276GI\327=\207 \216\275\237V\326=\330\235\357\275\205p4>\332\257\271=\351\200\002\275\357\355\007>\004a\257>#\tv<\2068\003\275O\204\253=D\003\253<\235\022\365\275C\276B>\303\222\257\274\357I\252\275\363w\313\275r\231\037\276\367V\262\275\177M\206=\326[n>\275\316\030\276\307u\207=zp\025\276\0234]\274\215\026\376=\226\246\247=\"\332\207\274\347Q\n>e7\216<qO\271:g\361\256\275\362\300z>\005h\000>J\317 >]\232\244=\270}~\275[&\034<\273\340\200\276&d\250\271H\300\326<>\0173>\245\243\302\274k\370 >\177\315\023\275\220N\307\275\225gm\276\263f\245\275\367\327\177>\325\266\232\274\'g?>\024z1>\367mf\276\330\260\262\274\367\026\n\276[\371\265\273\236\315\361=\021\364\274<\2339q\272\321t/>\224\265W\275%\232\372;\037\313\034\275=e%\276\253\237w\274\245\"5\274\260W\\\276\255\361d\274\263\305\016>\352\322L\272 X\260<|\014e\276O\217\014\276\261\017W\276}\377-\276\244=\027\276W\206\357<\035\221\261\274(\301\275\275&\311\357\273/\377\035>#\244\360=\277*K=\201\272\037\276\361\352\302\274\301\353k\275B`\253\276\310Fm>9\0028\276D]\322=\247\247\206>\233n\353=\201\373e=<\237\236=\203qJ\274\0354\310<\371\2743=\217\274\375=\352m\007=q\350\034\275\2370\211\275\310kB=N\345\200=\317`\215<\330\177G\275\343\223P\275\310\r\271=\374Q\341<\311\354B>\317\202\314=\017+\223<\266\217\255<Q\024\247\275y\201\267\275E\260Y>$\020N=\261\243\272>\023\254\010>\362\0027>\256\340\271\275\'\316\r>P\216\337=hi\207=\006\245H=\265\207\206\276\246\367\377\275\276\273\">\305\254W>\245_\233=\035\3708>D\3005=>\377\366=\024\304\234=Mw\213\275%=\254\275+\267\331=\233\025\255>\006\231\227=Jh;\276\325\002\336\275\277\001K>\241b*\274\227\373#=\364\256G\275q\350\206\275\016l\271=wO\242<Uwb=\3457\327\274e\252]\276(\277\311\275\243\363\236\276\303+t=\002\207\337\274\252\355\r\274i\021\340=l\201\003\276\342a\325\275\020\344\212\275PWH\275\207\233\027\276|\362\212>1\226&>\343\260\210=2@\010=S\247\241\275\037@D=\245W\030>\353\263Q=\302\224\340<kBB\274\340\232(\276l\200\216<p\373A>\362M\245\275Q\342\312=\004\002\366=\327\266\032\276\355S\272\275\2635\022\275\362\\Q<U}\375<\312q\004=\273~\331=\002.\025>(\027\003\274\250\320\210>\026 \036=8\026\023\276\375\344\257\275\335\234\334\275`\312!<>2\201>\275I\005\276\224m4>\312\364\036\276\2419\335=\336\036c\276Z\366\255\274#+\025=n\3147=\311\261`\276*\344+\276\215\033[\275j\022\310=\302\257{=\224M\267=\267\240\007\276$\003\314<\256\206\255=\343\227o=\322\367\256=V\252O=T$\201\276\301T\350=\016z\231=\314\3415\275,\031\360=n/4\275\366\376?\276!O&=:G\020=\260\255V\275\311\274*\275\200wV=f\004\211=e\346/>\345\307*\274\024\264\252\275\243k;>p\243;<\246\3642\274\'h\224=\306\266A=\3040\323=\261\006<>\316k\261\274\r\032A\276\001\354F\276\304qa\276,\331\224>L&$>}\331\221\276\205\301\r>\346\337\'=\246\266\217\275\347f\262<\177\320\231\275E\336\207>B\n\203>\0131\221\274\313\035\324\275\375\002\237\275i\334\324=\300\003e\275+\242\341\275\233F9\27568k\275q\334h>G\035k\2761\207\024>\251>\223\275\010\027\202\275\250\2508\2767\2201>\234o\322\275\312\325\004\273\2019Z=Z\"\025=\206\014E>cQ\263=\007\315\345\275O15\276\307\352@\276\222\000\034=\324%\240=\335-n>\313\227\356=\256K\360=\351\227/\276C\343\331\274^^\262=\345\254T=j\264@<N\231\271\274H=f=\201\202\241=l\370l=%\017p=\"eV\275q\034\222==\005\335=*\225 =\324\362\361=Da\252\274\363\221\367\275\277kr\274\233\006!\275\246\000\230\276\350R\204\275g`\214\276\212g\001=r\001\205>=\312\367=\024\2617\276\256M\274<ze\275<\333\271\245\275\266Bh\276\372\357\216:\333:\'\274E\234\262\275\313<x\276\367\267`\276$\266b=\337\207\004=\361\261\320\275\2411V>@\354\006>S~H\276\251Y\360=\362\254\204=\337\032P>=\352\327\275\216\023\n=\014T\220>G}\327\275\013\235E=\360\255G>\214.}\276K~m\276\246\240\374\274\363\302[\276@\034:<\034h\222\275\265\373\302=\330<5\275s2\374=\025D\004\276\265l&=*\234\033>U*\036\276\277v\210\275\027\252#<\204\250\235\273\320\356|>\300\365(>eov=\213\372\231\273\r2n\275@tK\274\325\375\033\276\021x\226:[\014\332=\035\326\265=>\300\004>T\370\264=\254\263B>\225Z\233\275\203\320P\276#\371\333\274\376\271#>r\277\010\275R\335\177\276)\032#=\374\005\232=\351\246\275\275\205l\266=\332\235$>*\'{=D}\002>d`\307\275+\267[\274E#\246\275(\\\233\273\242X]=\257w\212\273\177\222s=\225G2=\206I\257>\360\275\271=\372\223N\275\221\3254\274\361|p=N\201l\275\024\311\311\274Q\033\310<\022,*\276\020D\207\276rM\206\275nP\233\273n\274\333<\3265\017\276\240\361a\2765d==\321:c=:\006\254\274\006,i\276\200\320\371=\017\t\205=WJ\221\275g*\014\275\'\267 \276a\322C>\300d\236\275\035-H\275\250\352\207\275\004\362n>\341\244\t\275\211\014q>\010\241\214=\000\274>\276\344\311\314\275\200z-\275\244K$=\\\253\314=\326y\006<\025k\234>k\310\\\276@\206!\275\231\037\242<\n\373\326\272\320\020\r\275v\270G\275\260\031\021=\306\000G\274\"Y\247\275IV\354<\263\367\217\275\177\250\211\275.?M\276\004\t\256=\266\311\302\275\2122\221\276\025\3419\276MQ\035>n\3628=\220\223\t>\352\027\243\275\025;\330\275\251\300\272\275# \342\275\301\033-=\304\3122>%\202\233=+UO<Bl\337=\356\320\">\203V^<\036\357\004=\244\300k\275\345\0004\276\273kZ\276f\374c\275\017o>>\350@*= \302\232=%\tl=\350#F>\336\213\367\275\025@S\276\017\235\365\274\366c<\275+3\313\275\033\034$>\345?\261=\316\213\035>\232q\274\274\\\347\035>\315\357}=\371\237 =2\267\223\275\356\007\214\275\210!\262\276\'\212G\276h\260\364=\310\371\304\2759\307\">\205\356\026=Y\037\226>\036\356R>\271\233\340\274=3\340\275\333&(\275Y\202Z\276\342\0236=~A\036=P\375\275\275\304W\320\274|r\304<H\244p>\324\034\233\275\220\003\007>#\244\370\275\220\271\265\275\326\027\026\276\034\232\364=\002\343\244\275\260\007\002\276\303~5=\022-\027>\375Z\267:Zs\013>\031\341\340=\036\037\020\275\323\302\202=\370\325\323\274m\253\262=\327[\250=K\006\031>\003\264\257=&\3024\276\377\312f\276G\0077\276\004\013\317=\r\235[\276A)\236<\'J{=\331h\271\275\344\304i<\037\342r\276lg\357=\316L\217\276E\321i=\025\374C\274\320\021\204\275\242\245\332\275\230\333K\276\237A*\276klU\276\243\350w\276\240\365j\276\312\312\201\274\263\3709\276[\313m\275C\366\356<\345\231>>\211\276\261\275\262\227\316\274\331\352\225\275\032Y\315\274\307A\272\275#1\t>\250A\223\275\344\225\326=^\277\341\275\235\207\227\275\327\276\007>(\272`=\240\312\261<\352\317X\274Bj\316\275\226LR\276\330\334B>^\220\203=\373^\'>\300J\330\275;)\225\275\250\366\213=\316\306\252==*\214;\222\036\273<2\003N\275\314\r\252=\317\007\177\272\\\354m>\264\251A=\361\374\260;\356.7\275A\231\r\276H\346\372=C/\262=\212d*\275c\006\314=\313\240\354\274\274`\330\2759\210\224\273\202\036n\275\372<\216=\250\003c\276\242\304\213\275\030\r\220=Is\001\274\314Tq\275\177\007v>Yd\313<\377\022/\276&\342o\276\223\335.>q6(>{\2223\276\212\354\243\275\361\3347>\253\3508>\021\355\344\275\303\034\310\274\376\271\002>i\307\017>$\336\006>n\352\340\275[%P\276\020[\221\275\372\367\224\275B\314p>\304d\n>Y\223C=\350*\370=\262l\214\276\020\353\305=\241S-=\365\003@>\301*\361\275\007B>=\305kL\276X\030\361\274\241\315\205>\311\021\263=U\265\361\275\34552>\205=\334\275\246\352\254>\316\t\002>t\334V<\235\362C\275N\250\223>\244R\275>\343\223\005>e\035=\275\263\353`\276\007\205q\274\214\371\264\275\223\206\026>\347b\351=\033\235\027>\231\351\001=+\310L\275#\2461>\205\025\013\275\354@\222\275\255\367\247\272\333\002\336\275b\023\322\273\351\250\233\274\315?\006=\215\221\256=\375\256\376<\320\365\006<\245<\034\275}\326\241\275\327\272Z\276~g\257<\010\255\010=,\332\010=\355\301\036\276D\034\006>\343HS\275B\306\034\276\300\324?>\2615\347\275=\330P>q\342^<\022d\010=\001\340\304\275\030\214]=\272\300\217<\315\027\022\2765\377\017>\361m\217\273h\361\344\275\327g\204;\224\230:\276\355\207\247<.k\t>/\331P>0\242\353\275\362\313\221=\242\203\207\275\250u\366=\027\2361\275\016\255C>\323!/>\220\214\262<\202+\372\274.\177j=\201a\177>%\035\003>A\300\020\274\273\226\206;\1778x>{\325_>L\232)\275\\s\021\276\357\355\010=\262\311Z\275}\025\245=\314\227\216=0\036&<\235kB\276P\367\017\276F\315(>\334BG=WY\001=9\037\310=7\205\366\275\357nj>\272\340Y\275\253\264a>~^->4R\027>M]\177>\213\0304>\233\2768\275\013Bk>\3215:\275\364\333G<\331E\366\275\313U\206\275\020FD\275sjA>n\004J\275\237\016;\275\352\266\346\275\3127\275<\230\231\314=tU\354=6\362\030\276H\244\001\276\315\336[>L\353\317\275\342N\316:\350\022%>\263\324\332=\327\311\357\275\371A\306=c@\322\273\237\266\n>=\347\242=\230\253_=\014\213\'\276\267\271\227<<\252\217>\352Sb\276z\211\247\274\333\354\014>\247\026:=2=a\275\365\000\240\2744`\005;\324\037\226\276C\354\251\274\301\311l;\347\005\213=a\026\022=\203\327\303\274\304\013H\275\335\252u\276\001\217\333=P\000\'>VgR\276\224\334\324\275\n\ry=db#\275\365\231\244=\375\370\310\275o\017\013\274H\372\001>y\315\000\276x\007\001>-u\341=(wr\274\362\373@=L\2574\276\026\350M\275$*->l$h\275D\344\203\274\004\354\252\275\021\262\207\275\340SY=79\236=\376\342\n\275\026K\227<L\002o\276\3446\342\275c\3440\276\343j\265>v\220\243\2751\273\320<\3209\232\275w\004\266\274b\244\017>]rO>\341\366?\276\2755\272=\363LY>\'\356\334=k\371\252>\267\032\335<~\022l>b}\240=\177{@<\265 \021>\364\275\370\275~>7>\212\373x\275\257\231\024\276\263\317\003\276M\346\270\274\323x\377=\217\317\261=\0350\031>\224\257\022\276\005\274\314=\354C\361\275K\3024\275\332\025\n>|a\314\274\007`\240=\304=(\276\254\311\021\276\034f\264=\216\033\310\274U1l=\3509\354<\214S\265\275\364a\022=\314\022*>\347!x\276\300\247\226=\330\376\300\274\031\325k=G\246\323\274My\025>\327\334\326=\241\361\212;5j|\275\326\020\024>\'f\230>\224\266\261\275L\313d>bU\343<\n\277\n\276Z\217f\275G\305\275\274\366\024\225=\244\243m>\215x\203\276y\253\022\274\001M\371\274n\217\261=\276\214\032\276\036B\223\275\216\207?>}\027\302=\334i\242\274\270A\235=\226\343\020\276K\257~>\356\273\341\2758\353\007=\2041\234=\201\363\260\276(\263\220\274.\020\272\275\331!2\276\032+;=%Id>\361\355[=y!\261\275\\\331i\275\027\345\034>:\027\200<\3329\037\276\371:\262=\r\276\254\275\210\312\224<p\207\r=,?\227<\275)\244\2755\310J\276W\272\026>\016\007\016>\026{\321\273\330\037\367\275X\367\013\275{\245\222\276\321\352\322<\374\0225\276\026\237*\2766p\310=\020\220\201=\270Ia=\330\003\003>A\312\272\275\330\014X>\t\230\323=\242\266\021\2753\255e>\335\301\336\275\026\302\233=\333\2333\276\215\305\265=g\264<>\3107\356<\200\361\271=\254\257G\275\223\270\330\275\262\204\313=8q\266\273\315f\203=\365\213\300=I\312\345=\n\347\373=\331\256\022>N\304\257=\333\271)\276W\307\002\276\267C\013\275\231\220m=Zq^>\324\222\314\275\236\024\215=\335D\311=M\327\343=\347\3308\275\371\2250>\033\203\003>\273\020\355=\'\240m<\222*\026>d\"\005\276\313\227\000\276t \216>l9\352\275X\016q\27623\377=\327\332F=\243\023\251<6\320\034\275\2712\034\275:\222,>Lva= h\362=T#@\2758o0\2765V\000=\200\225\036\275\247 /\276\274A\'\274\221\364\312=,\024\021\276\237\316u\276\266\330t\275\006I\025=o\336)\276\336\351V>\316\031t\275_\203\005=\242\321*\272\027\022\r<bq\244<\361q\241>E\334\005>\343\177\313=\347\031\226\276\374f\353\274]\324\003>\255\"p=\261\024>\276\323\375\264\275\201\246\233\271\367\346\342\275D\230\302\275\345\234\027>F\315\355\275T\0057=j\337I\276SfA>`\236\211>?\236j;\354\325\252=\\e\\\276\345\336F\275\013\2060\276(\207\241=\241\373\257\276\367\321\212=\266S9\274\251\3758\275\004\322U\275\352N\224=\252\347\277;\366V\315\2754\374\262=\340\224B\275\251?$>\375\330\256\275XM\252=\347\326\037\276\366\211K>\364\2559\2764\001\354=\242g\270\275\363!\317<>*\320\274\260-\231<\275\274\240=k\220\226\275\230rb>\020d\327\275v\010X\276*\247\202\276\356K\367;\340P\037>\\\313\336\274\273\371X\275)\206\202<\350\211\032=\322\343\373=\244j*<4\337\311=i\336\245;\010DR\276\337_\307=/c\377\274:\002\203\276\010M\257\274\367X\016\276H\306\337\274K\374:\276\233\345\215\275\024\304\320;\241\215\220\274\3255\">\363`w\275~\206\262\275k\310\024>\274\266\245\275\207\224\234<.\331\025>\314\007\333\275N\213\265=\376\005K>1\244\317\2750\242\033>\217$\355\275B\031\216=\214\316\356\274\346C\024\276\033\327\271\271\321\264\001\276\353\351\372<\232\201\221\275\230\356P<jn\265\274\006\257\264\275\370\026\377\275#\256\031\276)\303 \276\0032\300<\270Gm\276\256\240=\276N\377\362\275\2716\202=\244\351&>\334\302Y\2743\006\"\275V\0308\276\010\'\276=*\234\032>\212y;\275@b5=\032\036\232>\3250\373<\351+7>\034T}\275YV\236=\320S\203\275\325\204\325\274\331\003\275\275\206YJ\276\214\313\320=\027\360\000<\221[\325\275\355\257k\276j#^>\233,\245<WQ\n>)\033\343\275\371\3521=\361\234\367<a\007\334\275w\336\250\274\347\221\350<\251 \317\275E\014\314\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
