node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 332002
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\002m\t=\317\332\237\276\364\252b>\274mS\275\301t\212\276R+f\276\360\352,\276\272\330\225=\342\037@>\027\213\343\273\nZ\313:\222\034\266=\375C\302\275\275\206`=T\251`\275\275Q\243=\321\332\240>\257\340\331=$6\233=\330b\263<C\023|\2757R\n<\371\315\\>\327\265\274>=\221\t\275i\272\203\275\352\341\321\275\353D\311\274\354Z\002\276C7\'\276\215}:\275op\017\275\254\352^=\013Y\315;\217\267\360\274\251S\270\275\225J\020\275\222\331\007>\327\255W>\344\346\325=\031!\363\275\222\224@\275J\370\350\275\'\3207<eM\245=\2272K\276x4\345\275\256\313\323<Dz/\274S\312\204\274\304\000\255=\341\n\001\276vz\177=Gf\035=(\212\204=kZ\037\276\350\370[=\271\344\030\276\263\\\221\275\307\353\344\274O\376\026>\013\001\036\276\344\3561\276a#@\276\272Fv=}\0043>e\277\303<\220\361\305\275\364G\212\276\243p\003=4\250\363\274d:\035=\224\340\272\275\364\224\254\275\224T\311=\006=(\276X\004\'>\227]\317<\335\003#9\271\232\256\275\213\333\025\276\201\032\371\275_#F>\266\202F\275\3066\303=X7\342\275|\313\327\275\255\005\200>\345\215\032\274\021\220\027\276\265/\031>Gk\340\273\335^b\276\306\341\214=\311\237\007=\001\360U\276\355\226\243=\370\017\022\275\357\323Q>\301\356\023\276\210#\272=a\010y>\326\303D\273P\035\254<E\331\037\276\323;)\275\345\326\351\274\271\"\027\274\271\267\356<\317\321\r> \271\036\276\317\021|\276\027\310T=\307\211\244\274K\035w\276\305\330\342=-c\016=\260\260V\275(\201\343=$N\274\275\361\260\257\275\'\310\272=n2\016>k\357#=\351\3329\2769\177y\275\347\000\007=\034\337\266\274\030\\\222=\324\367\010>\372\324O\274]\007\230=\355;\232\276\256\245/=\027L\"=\225\230O\276\214d\207\274\341x\307<\215\341\365=\362\2510>N\367\214\275\213\017\031<\257\273\2129\221\2260\276\016[\355=\232\022\303<?\313*\276Q\037\213=\313\273\206<<+a\276\233\2555<\243D\240=J~.>\275\032\251=\233\314J=~\341\\>\244\2039>{&\312\275N\276\214\274p\216\371\275eN\033>\260\217\005\276\017\207\001\274U=\256=\243p6>\226\325\272\274\223\215\203>\250R\021>f\322\343\274\331>\205\276$\353\343\275S\361\324\273\005(s>:Y\363\275\312\n\231\274\344.\210>\271DN>m\"\202\275,_\177\274\354q\214\275\372\013\306=v\354z>\240\036R\2740\233\032>\204\3107\276\222\272\330=\355\324\025\275\316\226\010>\377m\234\2768\201\311\275b\366\007\275)\334\032=\002\t\362=\325{3=\242\360\340<,\027\244=\343\304\226=\343\315\263\274e\255\342\274\037\202\361:\351\255N=_d\225\275\2626\205\275\323W\327=\276\375A\276\377\345o=\354\200\002>\332k\362\274U\'\247=\273U\177\275^\214)\276\351ky>\020\037K\275s\222_\276\304\365]\276\316B\024<\177\251\207\275\030*t>\371jd>\225\210`\276J9\336\274\001\003\007\276w\252\007\276\033\324\002>\244{\255\275\337X\003\276\355*\244=\3014\310=5\010\n\274\207y\214\276\354\337\271\2736\242]\275\372\244\022\276\214f%>^t%\276\220G\032>;V\225=\312\323\244<{\315&=\365\324\200\275y\365\033;\336\001\252\275\221\020/=w\300\377\274\027h\036=\340\330\317:H!@\275\200\302\022\276\215:\326=\347P\\\274\206j;\274\277f\202=\332/i>\321\232S>\251t\272<\205jE>\356\213\366\274/\334\237\276\232\3139>\240\3151\276F\237\242\275\023\245\333\2744\340\314=\302^\233:\204\225\361=\007\276l\2752\351[>]\330\003>\215\370\351= m)=\005\254,=\005\365A;\355\317\247\275(xi\276\013\271\314=\246\326\n\276\250pV=G\034y\276l\367\006\276\203\361#>\325*\272=g\257Y\276>\353\200\275\007\231\347\274\313\217\271\275\251\204\025\275\370\027\372\275\365m\353=\313\\\367\274\023Ri\276\233\"v\276\373\275&\276\235\017\357=\227\353\016>~X\236=.C2>\200\330\341<B\035v\275\244`U\276\247T\025\275^\362\241=<\336\212\273\233\316\327=\227\203\014\276\277e\271\275.bq<\244\235/<wT\205\274\033\256/\275C \335=H\264M=\205\265\241>L\006\234\275)\260R\275\232\177\004>\024\365w\275\030\0357\275\\1\237\275^\307\377;\254h\270\275\220\343\016\276\250\376(>\2004\034\276\373lQ=\216A<\276\004\357\034>\250;0\274\362\271\021\276\322T\250\274\210|s>F=u=\345;\031\274t\0255\276B\205b;MS5\276<a:\276q\201\365\274%\002\034\276\265r\032>\200\325\2069W\324z<\300p\010\275\230\374\226\275?u\371\275\346\276[\276\020\2701>/\014\355=oA\213>\274o\n\274\353\255\310=\225\346\335=\324\361\t>\377t\326=\324\307\245\275NG\247>\023\301\304<{\004^>\322\021\301\275\204N.>K\245\241\275\327\346\370\274]Nw\275\037\214\016=k\216\276\274=|\n>\355#\005=\216\030\246<\277Qx> \006\305\275\363\205\301=(M\363\275\376\361\322=\004\335\274;\342\257\336=)\211\272\275\353%e=cL!\274(\302\206;au9\275  \247\275Yh$\276\363\021Y=\032\316\013>\357c\324<\003\007\000=\215\233\331=%\351]<\033\340\244>\261\005\333<]?==\227\246\016\276l\206L\274\352*\213>$6\233<\274\236C>\023\375\307=\263J\034<<\343\334<\220\237\223=\356d\330\275_~\232\275\211\2701;\254\326k\275\\\256\027>!\362\353\2750\273\216=Yug\275\010J\213=\213:9\276\207\326\306\2756\301\247\276h\242\215>fj\"=bT\207=\021\327\007>\251\301\220\276\326\243\333\2755\301\010<\360\315\257>@\372\223\274\023^(>I<\226\275?\006\005>C6\017\276\3167O<b\nd>T\250`\276\2560 =\254\035\013\275fA\030\276\014\213\204=\2165->\215N*\276\352l\026>\300-O\275\266\200\256\275\271m\202\276\230\342\020>LRj\275%\331\257\275S<\221=A\340\207\275]\300\256\275\251P\372\275\373{\333\273[\356<\275\247\222W\276\260jY\275\230fi>\272\2321>\230\304\033>\246Y\212<\020\300\355=\247\356\026\276`\263\017>o#\002\275\363\212\002>\253\036|=\034\002\215>o\367\025>\357\002\327=\270r\t\274<~\260\274a\335X>\222{\000>\341\331\306\274\005\263\236\276W\332\351\274\306a\235\275\317fu\275H\206\274=\307\371\264=}0\010\276\251Y\201\275\266\313\272<\271\024\274=\327\243\301\274\250\3021=\010\207\033\276\3642\313=\364k\255\274S\244\000\276\233\343\032\273\233\0166\275\267\313*\275\260?9=\310N\215=i\315\375=\031\031\260\275\352\257C>\330C\334\275B\270e\275;\303\004\274\264\005&>(\373\r=by\273<W4\032>\203\261\261\275\211\335\320=\377i\272=X\n\320>\352\311\017\276]\276\341\275\022\211\255\275s\031\027>\017\345\202\275L\213\r=\340=\r\275\210NZ\276 i\035\276\251B\371=E\340\313\275\340\320 >\212\373\255\275?\343,\275;\301G=&^)\275\2052\354=7\343\271\274\266\2125<UxI\276l/L>\361a\326\275\232 \002\276\024\231E\276\236\234|>\303Y\207\276\330\246%>\312\316\207\275\241\232I\275\364\316\372<YIN=o\217\002\275\233\221\'\275}@\321=\032\217\177>W\007!>\300\213\301=\037\033\035=\240\037\036>N\200b\273\250\263#\275\306P\340\275%(\276\275\"\235*\276N\363\220\275]\366|\275+\306\245\274\0314\201\276\3700[>H\245\033>\264\224\247\275\230\370\232\275[\340\\>O\031P<\362()>&K\233=bQ:=Z\243\017\276?\372\253\275\227\307\275\274\305M\032\276\342\351+>\235\207\305=\021\355^\275\261\243\201=Fv\035\275S\247\300=\261\001\006\276\341y\361=\334G\373=S\245\207\276`S\364\275\034\330,=\217~h\274\340\037\252\274YM\234\275h\345\302=\325\346T\276UO{\274&\344\232>\001\032Q\276\356\201\213\275tv^=\212\213\024<(\326\r\276\204\354[>\373T\023\275ix(\276\267\224\341<\221\277N=H\205t>\342\203\256\275\242\327\370\275\016\214\002=\323\264\016>cU\244\275\262i\002>\264\213\237\275(4i>r\034{\275n\222Y>\254\301\373\275i\306\032\276\0235f\276:\266Q\275\317\363\213\275\2467\235=\222\310 \276b\251]= \200\216\276\034\336\310=\217\361a=\270/\330\275p:\354\275\007\373\264=\252\022\226=wQ\341\274\236#\003>\250\203\357=h\234=\275\235\016\310\275\324dx\276\244\311\217\275\212f\312=\237\032M=\341:f\276\t-\022>\2753X>\311\301\242<\207\224G=\246\346\347\275\3611n>#\337!>1\341\224\276*lT\2751\007\241\275q\240\242\275^\200\326\274\357\000\247>\266\207k=\023\266!\274\261\031\257=\tq/=\320\341E\276nZ\345\275<\235\031<m\350\302\275RH\205\275J\323\215=v\206(<\225%\355\275\271\271\235=\340\220\036>\225H\347<r\021\337\275\203b:\275\352\023\211=$\362\352\275\372\033<\275@\266%\275\2113!>\232\340%=\370\2220\275y\002J\275|\362\\<\247\374\364=&\t\014\2753\016\002\276\263)\263\275b\234\">8\200\014=:GQ>\245+.\275\006\033\377=\327\214\003<\023\234\256\275\267\367\202\275\245?g\275q\277\206\274\206T\330\275\327&\243\276\300\325\220=\356\346L\274\334\361\202<\272\307\241\275-\\\027\276V\030R\276\312X\023\276\376-\347\275\271r\260=\034$\337\275n\252\213=\370\226O>\370`\205>\206V\t=\234\276P\276\"N\332<\243\217\230=nH\244\274E\034\331;\260\357\372\275\027!\031\276\346KI>\365\317j=J\361\374=\306w]\275\"xU\275}\214^>\271~\303\275!\227S=\367?y\276}z\227=,\001\254=I\316\267>\003\311\216\274YE\225\275\010\236 >\366+\r>\273s\370\275\266\321\000\276\230\341\213\276\372\247+\275\332`\252\275\032\325\033\276\024Yp\275\273\r\355\275\236\031\214\274a\274\367=z]%=6I\362\275\366\272m\276\231p\214\274\017\177\206<Z\0362\275\326\230\222\275?\271\035<\312p\r\276\023+D=\2669\026\275\265w\220\275\201Ce=\376\032\027\276\205\344\366\275]@\363\275Y)\037\276\270\330\020<\207\353\307\274\313\234\212>\206\352\202\275\306\260\323=LY\201<\214R\361\274O\305\363=\356x\323<\310J8\2766\361a\276\276)\177<\306\006\002\276/\036\n\276\013\007\346\274.\375$\276\014\225\334\275j=\213=a\033\310=\241\337a=\371\275\227\275\347\217\337\275\021\220\362\275\036r\314\274\362Y\272<\251o\375=\027\031\222\276&\025>\275\346\261{\2759k\203=Gl\027>\343D\021>dbd>\360t\312\276\024x\307\276\223\255\372<*\344\222=9\341\241\275\233_\374\275\355\344\023>>P\353=p\026\223;\340\210\240;z\314o<\343\032T\276J\254\227\275\212\350\365=\017\330t==6\004=\211?\361=JZw>\005rA>\337\347=\275\036\302\265\275\246$\341<\301\323P>\206\242\n>\362!8\276\035\331\234\275&\247\324\274\206V\260;9\207<\276\205\311M\275\215\024U=\032\363b=\237\3208>\332\274\344=:\223\220\275q\200\236=u1;=\211\351\270=\335J\004\276\232\313\236=\201\2643\276\023\\\024>\252\255R\275j?\273\275\036\030!>s\017&\276\027\216\217\273\343^\247\275\236R\352\274\025U\262\273\311\311\216>\203\254\345=\023\"i=6\220\260=\325l\335<\t9\"=\370\220\036>\025~\202\276ha*\276\2205\006\276\322H\336\275I5$\276*\264#\275\372\234\273\273O\t#>4\221\000\275\033\n\200=\324\316\351\274]\005y\275\353\'w\275\2031\'\273\3279\177>S\227\352\275\333H\214<\007\323\274\275\037$i>:\360\002>~\321\261=\222\017L\276|U\327=\267\311M>\306]9\276Y\375\205>`%\022>\310\344\025\276\301\306A\276|\324\347\274=\002\240\276<3R>\234\003\316=/\326\376\275\303*\024<\207\362\310=l\027\024<\020\034\031\276\376-\017\275\244<\220=\351\002\223\276\034\220\214\275P\367\003>\204\313\034>|\020\311<\300 \000=\007\377\347=\2302 \275\002\024\013=G)\301=U\377\360\275X\002{=WCw=\256\311F\274\031\225\032=\246\206K=d\375\345\275\'D\3239)\366x<\366B\366<[\034\010\275\322\307\211\2733\231\217=_@\243>=\230r\276\347!\013\276R\010\324<\021\310\005>ny~=\024\347W>\204\213\033<\035!k\276pp~\275Y@~\274J3\212>\213\247\347=L\363\337\275+\305\001=\355\257\023\274Z\030J<\271\271\257=\227\014\354\272\262_\211\275x:\025\274+j\221\275\260Yy\275\331\256\312\275\340X\027=\333\362\356=\237k-;0r\336\275\236\313a\276x\023\314\275\022\212\334\275\336\316I<\200\0323\275^\365`>\262\2374\276$\250\320\275\353$}\276\207\';>[\"\035\275\3539\016\276Tz\356=\362\366\326\275\271X\243\275\013\371\240<tl\033=\213\276\216\276\036\036\364\275\003\370H=#s>\275.\3739>\360f<\276_[\330<\244\370B>\233\3422=\245\301&\275\377\320o\276\344\366\035\276\"\341R\275\204?\020>3\202\013>\366Q\347\275\020%}\274\005\261@=q\3557\276,\2260=,\035\355;T=\006>|e\031\275\000\r\360=m9\034\2749\177\214<\202\335\333\275\227\246\260\276\362o\313=\2156\246\273\327\244O>\234\370\222\276\376s\201\275\340\265d>\220E|>]g[\276r;1\275\353[<>c\021T=\363v\313=_\001h>\017\224\250\274\201\261=\276\010\001\226;\220X\026\276E\267L>k1\026\276\271\017\360\274\332\213\205\275\235\215\004\275\376+K\275\277cg\275`\3565\274Q\341\033=\314-\277\275\032\004\324=\n\002M=(\344\203\274\360\245\232<\002\370\327\274\004f\343;\004\2174\276\233\022\354\275\336\210 >\030\035\220\275\233v\224\276\021\326f>\360\356:\275j\227\217=&\374\317\274\017\233\330=G\266\200;\354@<\275\224\274\217\273\363\210\016>s\270_\2759\237\302= \305`\276\251Jp\275\177\0037>`\324\213<If\377:\253\027\354=\225\000\321=\365\353\312\274\323J\000\276\037\251\247\273\201\264\352=Jg\252\274\261E.=\271\377\214\274\364\321\206\275\356+\245=\262\354&\276C\216\222=MB&=\273\315\262\275\203\177\026\2752\270\232\276\314\337>\276\004\201\207=\254\247h\275\035H\246\275\377\223H\276\325\2707\274\367\334\222\275o\345\r\276l\235D\2766$%\276\366\375==F\312O>\253\262\262\273\377J(\275\332\345T>4\010\313\2751\275\374<\004\210\252=`B\257\275z9\226=\342\264\034>\277\347\237\275i[\362\274\307\200\217=\026.H=b\274K\276f\223\214=\332\365\237=\306\241\337<+7\n=b\245\201>%\"x\275e\202;=4\215\376\275\323z\353\2761\260\257=\350\233\016>\010\"1\276\274A\303<\370Q\016\275\014<\346\275m\372\210\2754\3134>1\021\023\276H\214\225=\007P\234\275m\275P\276$O[\275\313T\262\275>\265\267=\257o\203\274\233\n\n>\350\343\017\276i\320\333=\037\334\241\2742dE>\030\206\016=\312,\257\275\330\017D\276\2726\270\275j\325.>J\253O\276|\217\312=,0w<\277OM\275\222\305h\275n\347\n>\246\251v>\275\224\232>\217\274\204=\234\253\347<O2\201>_\321\010=\010\371\252=\307\222\027>\373FY\276P~\264=}\217\243\274\351\264\344\274\333\360\301\274\341\240\326\275)|\357\274\027\321\314<.\320\213=g\273\'\276\272G\256\274\345FJ=\263q;\276\252W\226<\331\222P=;_\321\275UU\316\274d\022\024\276\010\327\236>\004w#\276A\365x\274}\335U>\223\"s\275VJ\373\274]\255\205\276m\227\002=\035v\317\275 \003\252\275\265\323H=\200\266\263\275\350\350\305\275\350$\355\275\366\350r<8*\267=\267\267u\2768t\351\275\261cp\275\231\r*>p\253j\275\023g=\276?\337\262\273X\202.\2753t\232=\354\265 \276lB\335=}\317\273\275Y\347\031>/\031\270=\223M{\275\244\365\250\275\354\034\311\275EZ!=F\331\255\276\361H\212>\314%\364\274E!\024>\264\005\344\273cI\300<$]\357;\\\201\'=@[T=\205e\310\275\223O\022>\332/T\276k\021\t>\276\007d\276\032\023\212\275\312\223\223\275\207\354\303\276\335QX\275\243\031\235\275s\373\264<0\0143\275\235\306\010=\310\213\007\275\251\326\205\276\275X\346=\021@n\275\257\\y=\244#\204\275\310d\006\275\"\337\237\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
