node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5549199
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\206\317\215<\260\234\222<x\355\353\275\374\025\207\276y\306\030>\'\224\001\276;\350\'>\215{\310\275\317\305\370=G\346\263\275\215\316\016=\tN\230=\300\234@=\262\271S=u\017\373\273\263\273R\2762g\000\276\007\225$>D\235\372\274\\\356\345=\031\244\236=\251\226S=\330\3164>\333e+>\373\206\003>\271\r*\276\371l\312\275:\252\221<\345\3107\276\357\250\236\275\357w\344\2750Bc\275\322\017\317=\322\243T>\222\005J\276\231\270Q\276\325hI<g\304\253=Y\016\203=I\031\320>\241\276\024>\270\233\350;\274\336\237\274\304\322\021\276\222\273\322\2741\272\213\275z\001y<\037\310P\275\344\323\013>Mr\221\273Ra\366=\370\324\336=\033\301\331=\2573X>\020Y!\276\265\256s=>\210c\275\303\367!=\003CC\276\203\226r=\305\273\250=\321\340E\276=\343+\275\330\362\032\276\"\363\212\276\221\202\023=/L\202;\340\3321=\201[]\276\303_\344<\217?t\275\301\304\027\276\2031\353\274\310@\025<\235aK<3\377\006=\374\207!=\332$X>\212B\006>\213\303\276\275\260\235\017\275%\n\025\274\360\r8\276*\215s>T\035P\275\tof=l\017\352\2749\334\036>\377\307\245>\225G\377=\220:K\276\307\346\310=\314N\177<\364\n\227=+\034\203=\343\177\004\276\n\261\320>\331\375\207\274\023;\323\272]\010\014>\240vk<\374\321\201=\210\246\n>\204\226,\274\375\320\027>\214\024\025=\315O\207\275\310\2425\276\035\"\246=\031W\205\275l\371*\274\313h\301\275\236\276\341\273\001\207\021<\3024<\275\316\n\302\275\313\243\207>\330\307]\274\230\216\361\275C\255\271\275\"LC\275`\223\227=\352\255\204=\322\234 \276qWP\275F\315\336>?\226a=h\3210>\034q\026\275\341\242\244=/\013\265=\037\000T\276\243\004\307=\341\030\255<\344D\035<\252\275D>\371\023\'>4\001\247<\270w\334\274[\004>\276W\030\304\275\031\177\334\275wl\304;z\030\320\274=(`\276\353\253\254=\"1\177=\261\027_>\205.\002\276\326\004\266=\305z}\275\262D\214\275\036 \364=\325\262N>3q\223\275\365\267\263\274\322\207v\275\244E\013>\340M\210=-\243\367=<\024\316\275\034\027\205\275\205\303\032\2762\274\272\274f\275\201<\202\022o=\220\373\026>\340\327\226\275\254\316\204\275\341`m=\310\247\311\272\244\367\247>{R\334\275\374h\223=|a\321\275\322\264i>\n\260\006\276\245\371\003\275\214\310(>\022u\233<\220\033\231=\254\236\326\274\263\251X=G\233\246>\304\302\007>\253\300><\301\372*>\367\231\272\275\235\336~=f\'\027>\344|\377\275\003\230h<\353H\037\276\232\207\323<Kt\205=\360\301\252=gwg\276\016\252\344=\375\000*\275\204\231\177\276\232\025\225\275\340Q]\276\216ZA><\2529>\302\367\362=\000l0=\036\020\023\276\347\245\023\2766\303\220=Z\037\361\275\017\376Y=\3521\217>q\317\342=M\225\347\274\375*E=\001\371*\276\347Y\260\275+\342\222\274\365\273n\276kWd\275\\\357U\275\205\245\026>\226\324\t\275a\253\221\275\343\240\326=\207\\\214=9\313\316=\247.s\276\366\254\023\276=\257\312=\010{\211:\330\371H>Zw\260<\303\346\233=\232&\252\275\340\234\003=\3207\034>{\273\014\275P\362\354=\002o\234=\326W\337<B\224\255=\\\010\200\275|\3114\274\n2/=\357\346\262=\205\225+=\255\320\234\275-\267\274=\366\312\245\275\360oc<\323f\261=\340\205b><\260U>\326\363\251=\250M\220<\210#*>\026wc\274\352A}>O\242\321\274\356vK\275J\244\016: \022\001;\226\326\315=\321\307\271\274\207\327 \276\317w.\276\006{\271\275\034U\317\273.\240F\276\n\301\356=\212\206$\276l\356d<\300\334l;.\"\255=\305\371\301\275>\3612>\276\345\037>>u\234\274Q\304\026\276u!\272\275s\246\305=\272J\247\276\032\350!\276\235*m>1\'\365<\331\231\302;\372<\216=\020\223\004\276\217\306\204=:\t}\276^m\214\276\340\326\250\276\010$g=W\347\356\275\203\005\203\275\000\255B\275\242O\317;\030b\370\275\216?\375<\216\277v\276\214\257\241=\200K\020>\243\313\373\275\333J\003=y\225x\275\270\306\275\275\324\006;>S%J\276\353\350\243\27575\234=\022c\r\276oEf\274\277G\016\275\232\377\302\275\216\013\335\273I\264R=\256\340\351\275Lx\333\275t\030\003>5e1>\216G?\276a\031K>./\021\276zY\002>\315Z*=\027\320\205\275\250p\000\276I\365b=o\323\265\275\213\260\317\274\240R\t>\364!\026>\362\312\021>(\013\335=\313/\265\275\205\253 >\235\367\003>\233\200 \276\262\213_\276XYH\275\031\222\204\276\376\201!\275`\340/\276\336\330H\275F\302\231\275]\2309\274+\260\345\275\223o\014>.\231;\275\303\035\315\274\177\177%<\206\365i=\276UJ=YS\207\276\n\277\247\276\2755\241\275\334\003F=\274\274\314=\215\267\014\276\315IA\276\257\372\223=\010\237\235>\347\313\033\275\310\003\323\275%\020\233\276\245\326\006\275\375(\374\275i\013H\275\334\004\002\276Fg5>\345rI\276\204\363\304\275\346)\204\275w\033\023>F\276$\275\204n\373\275+\236\267\275H\010H>\331k\001\276\315\346\321\27447\221>Y\215>\276=\304\326<\365\342\305=\022\3116\274\336\202\226>\3429\237\275d\334d=B\024\222\276)\3739<\3518\227\275\023\201\305=\007Q\342=\354CR\275q\021/\276\277~\030\275]\202\275\275\204\352\032\274n$G\274\000\251\351\275E\230\215=w&H\274\022O\035>\343\365,>.\237\347:\354u\263\274\230\360#\274\345E\205<$\035e\2755\020\212\274\375\211Z>\361G\027\276H\272\177\274\005fh\275FP\366=\307\260%\275\257\372\236=\220\245l=\367\004i<\3574\322\273\246.\003\276:i\216\274d\035\277\275\340\364\006=\236Sm\276fp\320=BG\310=\235Z0={\024\204=\254\205\257<m\342\354=\230\267>\276\250\273\200>\324\026b>\247\341\307<\325\316\250\275\304\276\232\275\310\210\364\275\312\000\"\276\004D\271\275]\314\223\275\201\3648\274\036\316\314\275\320\250r\276h)e>\021g@=1:(>\333\275x\275\370 \r\276\034e\021\2768\362\177\275\253y\301\273\007\3161\275\273\351}>,h\004>\207\254\023=\305\'4>,\266\004\275\3443n\275J\032\311\274\243kT>\214H\333\274\023\357\310\274\357e+\275S\036\320=\220_\005\276Y\335y\274\304\213\367=\273\251[=\316\006\200\275n\247\t>\226l\201=n7a>\324F\030>\017f(\276J\227z\276[\373\007>j_u\276\342 \272\275\272\353\276\275\351\243S\275\211\337\027>\220cI>,~\271<\'\371T\276\021S=>u9\271=\030\241\033>\212G\307=\322\340\013>H\030\310\275\367\351\335=\323\225\272=\022\230\205<\253\262[>A\344E=RDW\2762\217\374\275n)\312=\300\236\023>\373\316\362<\311\360\265\275\213\032\337\275s\232>\275\364\324^\276\201\356\n\276\037\337v>\365\027\230\275\217\371\362=\355\253\025\276\215\342\232:g^\260\275\246\342\242\274\243|m\2765$\332\274c\205\352=\317\335\375=\376\002p\276\237\375\371\273\320\310Y>\263\022\366\274\264\352K>\221n\017\275\311$\213>\225$q\274\330\361\210\274\036\275t=8\0060\276\240\245=<\357!8>\310\341%\273$\277$\276\345\310\346=\206\362\245=\260\030=\275\213M\316=\372\366\261;-\014\213=\223\330\037;\256\244\266\275\014\016\217\275\r\017\020=\206F\263\275\2252\275<\350z8>\350V\t\276\363\220\266\275\222\201x=\326\355\000>aT\326\275\341\005Y>\006w\340\275\260l\025\276\022\243\211=Q\214\332=7\255\223=Q\002\300=>\255C>\nG\356\275\221\252\216=\324\340\024>A\241%>\331\203+=\017\027\'>=\375H\276U\022\214\275\350\035\023=\316\2148>r\262\212=um\017\276*\\X\275\352\303\031\275V\274=\275q\017\257\274\337H9\275\013_\234\274\250U\2039\302+q>\233M\256\276\247\360\356=U\032K=\201!\257<97\351\275P\342\r\275\267\331\270\275&qe\275\313i\375=0z\244<|zs\274\026>>>#\365?>pX\204\275\\n\212>\212\013\315=V\326\366;\302\031\347\274\036\304\227>\321\216\004>\316x`\276?=\022>\000\336d>\201!u\275\321?G\276\363\002\214=\302xy=OHO\276\2133-\276\367\357\206\276\353\316\355\275G\201\316\275\037\222\027>\222\216\"=\231y,>\271\217\247\275\0131\344;\203\020V\276\343\275*\274\327\251\243=\307p,\274=\243\202>\024\231*>\027\306b\275\013-Q\275\372R\223\275\035\370W;z*\267;c\002*=\037\301\325\275|1\272=\372\246Y=\327\332F>\355\313<\276\022i\003\276Pr\007=\261\022\235</\321\343\275\017\001\277=X\240\032\276@\343h=\357\277\241\2741b\020\276}\320\273=\r{D\275\3753\245>\230\207\200>\321g\211=s\232\205\276^(\010=j\310\020=\252\355\232\273\267\325\315<\214\342;\2753\366U=g\020\353=4OW=&\362\003\2765b\326=\322\273\315=\233i\337\275\365d?\276\006G\025\276Ka\262\276fv\343=\326\214\036;\256\332\227\275\345\252\306<@4\244\2751\335I\276{#\260\275\036\212\347=g\013\r>\327+4\275\017\007t\275hx.\274\240Ud=\255g\304>\304\027\341\275\3501c<\262Z\263\275q@\357=\2323\261\275c\231\307<\263\2158>\3125L;\n\327:>\230\204Q\275V\316\206=}\332\335=\013FA\275\031\2519><\211\002;C\351\031\276\017\002\203=\262\375\225\274\213\363\003\276g\327(\276\366\265\017\276\t\307\205\273\322\210\252=\260\363\234\274\225$\032\275\334=\032>\t\304\345\275\030(?>\312*4>\230\340p<\3126z>\000.&=\025\003\205\275\'kp=\005\343Y>\375\210\002\273\010)\036\275\361\266\246\275\352A\007\276Z\202\372\275xC\244<\000\363\034\275\343\314Y>3\237\215= |\256\275\210\016\014\276\336\207-\276h\270\372<\371/(\276\262QT;\334KA\275J\027\014>j\231\037\276(\241\333\274\316\217\260\275BH\013\276\252)\367\275\304\267\200\275\331\016|==\233\334<\335\336\030\276/\244\336\275\321\220\227\275\201x\237\275[}/=-Au>pM\324\275\360\236\306=\330\0309=\027 ~<\217W\310=\344\330~>8}\001>\266\2069>\335b*\275\305\372\252\276W\014\024>%\037(>\244\202\266\274_l\270=\305/\376=\245\332\270\275\257DO=\344\006\200>\023\323\022\275b\330\374\275L\240\n>_=\205\275i\r\225\275<\2746\276C %\276\313\355\202\275\016\305p>\201N\001\276\360\330K\272.\253\027\276\014J\212\275\034\032\351\275(\032\202>^\343\3509i\214\331=\357\223\363=\234\002\215=\242\305\207\275\374\202\327=w\312$<#\031p\275c\321\001\275\036/q=\223\003\\>\337\336\010=\353\037\220\275\214b0\276?3\206<K(\215>\375\255\307=i\270g\276\024\220\252\275\215\267#>\023\016\203\275\232\364[\276\374\370%\275\037&\026<2\374\023<\205F1>(p==\351u\306\275\263\232\253\275\315\222\036>a\013\245\276-\302\225\274\345\340D\275\221HM\276\200U\017\276\32669>\'\335\307<\312g\234\274\362\271\333<\352\334E\275\"RE>! \213=#\027\237>ms\214\275\347\342\036\275\341r\371<t\326\235<\016K\211>\237\317\030=\343\222C\275T)\004>\030\035\345\275x$:\276;\204\213\274;\254\304<\310\307\311=\215\030\311=\2503%\276\204\312\r<}\354\277<\217Z\314=\353D\320=7\244<\276\251\357\347=\026\264\336=<\276\246=\316\323p\276S~\230=3~\327\275\263\2514=7\220;>\001\363A\276B\033 >\"\204\315\275\340U!>\227\344k=W2%\275BU\220\275\302\215\347\274gOC>VD\231\273\010\215\325\275=\223 \275\030\217\\=\325\276\250\275\243\232=\273p\366\241\276\322c\033\276}M\371=\033mB;\342\024\341=\210p\364\275\272A\251\275\276\033\177=\211\037O\276$u\353=\373~h=i\237\232\275x\343\r>\251\026Z=q[\006=V+\321\275\014` >Kc?>\357{|\275\326\215\213=O\363%\276\326+\r\276\\-\005=\000\371\362;\032\310\t\276\275%Q\275B\211%>$\262\027>\017\250\272=\370%\006\275,4\271\274\031v\337=\251\220.\276&\265k\276u>q<\013\335\300=\271\376\300>4A\364;\220O\035=\224_\315:\321&)>\261\275\272=\212\325\320\275\013\342\006>\300I\225\275\214\035\200\275r\372r=\260\347\211\275\316\034\020<\337\244w=\250\210/\275\233\013P\275\006\316\351=wV\205\274\336X\006>\334\035.>\032^\357=B\253\257=\214\350\322\275+\n\367\275\231\315r>)\3349\276\n\023&>d\\q>\204\321\316=n\ty\276\273x1\276\332\271\310=s\204\360\275M\350Q\275V\326\003\276\277T\350=\3143\330=\217\351\346=\357\030/=\223\0061=\245^\203\275\006\356c>%\034\004>\216&N\275\344\222T\275?\274\307<\247\273\304>\177\315r\276\202\221\235\275\226\234\205\274\221B\240\275Gw<\276\201\377\017<q\367\034>I\313u\275+\252h\275nzv>!\303\030\276i#\302<\360\0168\273\274H\347\275\346\023\315<1\006q\276DJ\371=\357f2>\243j6=\247\341\237\2732\245\207\274\224\036\317\274P\345\252\2749\023\207\275\"\336\376=\275I\333<\355\355\320>q\024\272\2753\322\323\274^oI\276\210e\232\275:<\374=\210s \275t\354\032\275\270,\317\2751\n)\276\366\227\242\275:\354\204\275\016`\326=z.U>\243\2725>\260i;>L\201\027>\366C\316\274+\334\003=\340\320\201\274\225\310\t\275\320O\306=\024\372\206\276\363:\272<\202\372y\275\213\374f=\377\000\216>\267,\311\275\215\262m>\326\215\237\275:\363\321\2754\022%>-\3618<\242\023\233\275\314\301\r\276Q\003\335=\267\2637=\246\240\206<\205\262\221=3\327\300\275 \006R\276\274\372\007\276\016;\005>e>\216\275B\027\036>\236\242\240=\237\322\324=\\%\341<\244\036B<\305VJ=gh\255>w\217K=d\346\025=Z\231\024<\276\217\213=>\247\200>\200MG>\201\202\301\276\351\246-;\200\034\350=\262U\010\275GX*\275\247\331\352=4yH>\246\341`\275\334\303\250<\271\325\360=\206\376+\276\204\017\023\2769Q\033\276\237\274\243=\335\257\214\275&h\257<\030\227\355=\375>\026\276\240\n\313\275/\034j\275\365W\272=.\260-=8\305\203>\252fE>`\014\321\275\363O\365\275j|\343\275\336\r\303<\210\347\205=\240?\226=!\263\202=$\317\305=y\3420>\325\227\330=\220/\222\275\230\331\245;:\267=<8\211\"\276Lj\203\276\363VN>\335\177M\274\273\305\261\275\177w\272\273,\334\326<Q\035\313=z\267t\275\374\237\017<\254\341\273;\316s\036\276!0T=\274wm=\240G\321\2758\357M>$BW\272R\237\371\274\023\034b\275L_\201\2757\347\312\275?\373\200>\002}\033>\220D\234=\270]\030>\327^\177>\004K\375<\035^q=M_\371=-\024\267\275b^|\276\361\261\036>\351IB=\330\034\312=\351\032\247\275\236L\344=x4\262=\034\262\273=\010\262\311=\027\267%>\372\202+\276V\344S;\353\t\002\276\325\343\r>\272\334\r\275\270\341\031\276i\3311=)\3168\2765}\321=dg\311=O\t\201>#\251\252=\242D\275=\252\006\217\275\000]Z\274\276.\313\276>\003J\276*\345S=m\302\233=\026m\273\275\260\325m=\030\264\351=\010/k\273\231Z@\275\262\252\010=oa\n<\275\323\353=]o1=O5\021\274\316+X>\004J\357;l\206\210\273\301\357\267=\'M\030>}Z\025>\002\337\220=7A\013\275\374I\212=b\203\004>\241\337\357\275\236\365\017\276-s\212\273x(D\276\207;\036\276\323z\227=\373\023\350\275I\032W=^\354\245<\211B\222\275\235\335\271=q\267\200\275`\271\306=\310\230m\276\342\266\244=\265a\360\275\304}Z\275\272v\201\275\002L\355\271C\023u\276\003\243\303<\021\330\220\275Z\2562\2763\000\275<\211\017\375\274@\274\327=\376\337E\276m\257b\276\376=\002\276\336\330\330\273\234\206D\276\352\361D\276\337$\346;\\\220z=\3268-:\245[[=\2044a\276\346\364a<wc\207\275\3621\265\276\315o\273\275\244\003x<\356f\027\276[*&\276\005\324\307\274\020\002\035\276\200\241Z\276\236\340\024=\233\r\227>_\254!\276uQ\223<\271\234=>\036t\t\275\317s\203\274\036`:=\332\374\207\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
