node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7986089
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "l[q\276\202+\217=p\005\r>L\356\237\275U\232\004>\311\3051\274\326m\026>\314\210L\275\024\201;\276@\247\223<\3422!<\324\332\232=\262G\372=\321\270\010>4\260\277\275\207\251c>&d\004>P\353\244\275\251N\r\275l\021,\276\355\2138>\033\357#=\032r\267\276\233G\216=G^\033=\3369\202=\315\351\201\275/\254\032>\006\353E>\007\354\216=36\006\276\004R\027>\337\200\265=\263\326K\276$\271O=\343\014\361\275+\262e=\222\'%>i\374~=\0328\007\275\220\243\357\275\225\232\332\275\254\232P\276\014\346\007>\001n4\273\213\2358=|\323w>\376\025m\275X\2370>\345;M\276j\324E\276p,#>JQ\250=&\237\246\274\276\275A;\3766(;0\207\275=\273\374%=\324q\221=\356M\271=\333\234\326\275$\212\026\276\261\223E>\017\272\277=\346\363\227<\010\201\013\276\006z{\274@\254[\276N\231\376\275\004\224K\275\005\337\303;#\2252\275\016M\224=U(\006;\265T\004>\016y\335=\253\342\357\273S\372\323\274^\004\373\2746V\020\276S\n\'>*\375D\276\271\200\021=\020\2640\276\004_\343\275<\005\207\275\'\353,=\243\317\017>F\317C>DX\001>\323rT\276\325LD\275u\327_>L\252\031\275\377\340;<f\351f=\210\256\212=\034\235\210\276\337[\305\274\245`g>\313\223\326\275{\206Z>l\005\235>i@\302\275\001\010\211\273\345\210\202<\000DZ={I\272>\375\201\352\274\215\317\000>\211\203\367=\217\243\010\276\316\213\267=P\266\202\275QX\225=j\232\212\274,\0357\275\353\222\272\271\323\244\233\274\261#\244=.\036K\273\343P\365=\220\267\020=\217\201\373\275\007\310\364\275=\203h>\200\305\345\274\2576\300\276\007\355A\275\253<1>\204T\240\275n_\365\2753\244\266\276U\014H>b<k=\004\375\242<\0346\212=CJ\374\273f\257\353=!#\307=\207/\036=E\341\264=\023\024\306\275;{\014\276G\004{\276\206\346\023\275\372\376h\275\006x\322\274%\231\r=@f\344=b\273\260=\222\002\006\275\0253V\275\303u\250\274\265\\a\2765\311\303=\177\016k=\3129\036>\322#]=\361\323*>\300$h=\310\211\257\275\nt(=\354o!\276s\351\006=)\375J=\215\3568\2768\030\013;\235\304\352=\231\036\003\276\220\203[>WK4>\240\205[<\220X\322=\023p>=)\364O>w\247\010>\337@[\275\242\035\342\2746D\360=R\273\232>}i\031\276\215\301\240<o\333\377=\004\230*>\264\315\250=fP\027>c\037(<\214D\326=\247\243_=\340>\"\275\317Z\023>\332\023!\276\240\377u=\230\343\t\276F\036\222<L6?\276U\203\007\276]\243\344\275?\261\353\275\034@\001\2753\340\022=\277\312S\274A\225\200=-\254\365;\373\333\226\275\033\272\256=;\035\350;\360\342W\275\231\014x>\305\300n\276\3258\235=)E\311=\031()>4\\\374\274\225\035)=?\241\232>\243\255\353\2754[]\274v\202\341\274\311\215\263\274\312W\343\273\214og\276\020] \2768\263b\276\204\033\022>\306\224\005\276!\313}\274\367\317X<\033\344\322\275xUj=\306\2008; \022\373<\350H\242\2741\303\177\276nL\235=\325\224\261\275\314\224\253>\034-\261<>\263_;\276\213\024><\320[>=R\330<g\205\270\276\242\315`>u\207\203=\2612\001>\262\325\256=\306\261z=g{u\275w\205\020>\304\200\330\275\177&\227=\315\337\001\2760}\211\275\001\332\204\276\2055J=r\360Z\276\2531\270=j\260\313=\371=h<\331(7\276`\3670>]\365\016\276\2653/=^F\027\275\221\243\233\275t\265U\274\254.\226=\310\303\224<\373u\001\276\331\373\273\275\213\310\032>\247\007\333\275v\316\"\276\"2M\276\212\032%=\330;\250\275\252\0179<\375D\235\275o\022\314\275+%\r\275Z\2262\275\2435\034\276Vj\363<\355\362>\276F\027]\275\330\253\250=I%\304=\322z\265=\353\316\366\275\277F\256<\217\336\303\275<\016P\275{\275\025=\305\2718=\\\334\277>\036\227\330=\344D\323\275\r\275]=\221<T=\324v\202\275\345a ;\2357c\273\037\235\221\274\037qz\275f\365\363\274\277\343\271\273\306\366\022>\211\332{>\267\204\n\276\177\312~\274a\204\031>\334\301\242\2750\010[\274\301\003\334\275\225\2775\275S\237\227>!pZ>|ah>\250\303\023\275\276\024l=\037\334\003:\326dA\275[\365\207\275\376\036\241\275\353\373)\276\250\241L\275\353[\036\276\005\362\350\275\323\017/\276R\237\311=v\255\344=(\010\301<\027\243\255=\254\221G>,.\263\275:\361\273\274\335vx=>\003\007>\2132]=\305\305\243>\367\267\037\276\221\243\240=\253\026\263\275[\350,\275\037~v>!\351j>\251\017C=HRm\276\346\267%\276<\350\037>6^ =GV?>\010\325I\275\366\035\006=f\310\353=mb\366=\031\354\333\275\270(\305=\3736\n\276\355\031\372\271\355\007\333\275P\033\275\274Rt@=\363\254\306\273\271\357\203<\357\300x\276c\211x>>\304{\275\371QH:\345\305\330=\252\033\r=\0224)>\244\024\'>\326\277\r>\300!v>l\346\276=\333Rw\276X@\251\275[\327\201=p\013\361=+\246_>\034w\237;\330\022}\275o\'\277=T\210\241\275\307\035\020\276+\310\016=e\370V=\351\240\217\2731\177\373<\366\353\222>\256N\200=\320\"9=\255j\237\275?\307\033\276\346?V=\304\017\352=e\235n\276t\361\026>\363\017\312\274\006\2414\276\213\225+<\036\215T>\212W\023\2763\0166\276\243\331\004>\336\'R\276\257\241\336\275\301\354\200=3?\327\275\304*\371\274znu=\345\372\201\275\206BO\276\222YB=X\026/>\370=\303\275\001\035\253==Wq\276C\372\242\275\367\351F>\353B\231\273\252\r\205\275\322H\317<\305\r\027=\307)J\274\334\257?\275\2720\220=~\375(\274\260\267\002=,\256\241\274\031\266\003\276\3274E>\033Cf=9\347\021\275K\266\307\275\347\236\214>\346\362\352=L\001\003\275\246\312\244\274\235Ab\274\231Af<\202\3739\275r~\312=\003\035\033\275\003\023\033>\250e\010\276\204\004\204<\352_$>\007\364V\275\220\246\333=\364\311\210=\035\322\276;\332\000\263;Q4a=\226\366\000>\247Jf\276v\354\005\276uT\225=?]\241=W\307,\276K\r,\276:>\213\276@\220\256=L\'\267=\232\016O\276\031\205\237\276 #\271<\225Z\256=%mj\276%\037\031>\020?H\276\024\020\376=\0056\326\275\215\221\204>wF\016>\016\017\324;\302\261\352=F\305\343=&@\005\275>\255\317=\315\377I\276\277_\205>(\336G\276\330\223\210\276\230\261e\275\252&\035\276\343\203\332;\240\211*>\024\026\324\274\367\227\347\274\301\025\031>\017WM\276g\230\367<`\237c<\353\277\037>\004\202~\275\300\260>\275\322\323\214>\2407\343\273J\374\030>\315Kl=\022\372%>_\020\006>\034(\360=\302\316J=\371\033\207\276Xz6=\255\267)=&\263\030<\257\207T\275\346\230N\275\213\304\337</\342L>\023\340%>p\321\210=\r\326\267=\221@\357=N\247\\<\036\3750>\2168R\276\2760\226:*\213\232\275\022R\227\275!\372\377\275\201\226\312\273\205\260\025\275\023v\270\275\250~\017>\006\275)\275k\260\337\275(A%\275)\230->\355\304\005\276\2515\021>\235`N\276\252@\002>\323\203\332\275-zG=\255\341\222\276wc\333=\222\213\032\274\033\010\024\276u\001|\276\2070\237:h\243\326\273j\335\234\275\211\303\200\275d\312!\276\221\216\027>G-\n\276h\3515=\027\364\305=\177\267\304\275\230JA>\003\2648=l\336\322\275\352t\261=;\367\013>\245\000\'=,\227\244\275\325\326\365\275p+\002>\373\210\347=\211\227\351=\202\214\342\275e\247\274\275\257n\342=\353\253\214>\220\362\\\275\311\014\033\276AV\236;s\332\230\276\366\245\251\276\225\207\200\275\227y\005\276\241\326k\275\277\014h\274\016L\355\275Z\373\362=\260+\316\275\337\241\324\275G\223\304;\001\273;\276\'\3338>N\353\321=\000\206\300\274\347\2518\274As\215\275:a7>P\\+=\377\222n\274\317\233\326\275\335\n\002>\245v\213<\022\'\006>X\311\025=S\261\017\276\351\253\r\276\2117#\276\201CO\275\210X\212\276\271\0023=\310\231n\276\367\232\217<\341\363\212\276B\223\034=\204\013l<\016\2743>c6\360;\370{s\274\3166\222\276^D\251\275\226\256C=#\304\250<\\\0001\275\325\304\001\276\343\365=\276\021Q\301\275\325q\241<Ak\223\275\034\222\014>d\r4\276\314J\262\275\221\031\032\275\367`^\275\031n\r>JB\201\276P\223\\=\006|\235>\244r\327\275\331x`>\3426\017\276|\2002>\034\231\276\275<+\030\276\030N\313<#\203\237\273C\255\250\271A\257i\274\263\262O\275\203\tg=\037<0\276\001Q\252\275\303\276\224<\250w\000\276\327\026G=\215\202N>\262\237\245=+8\231\274h\033\210\274q]\302=_\205v\275wI#>\271\376\r>\375g\205= e\236<\221\210\235\275\226\031\242=\273Z\002>\274\316\202\275@W\201=\033\241W>}31=%\267\276\276\016J%\276\033\236\003>m\006\253\275l\350\223=\037\334\032\275\262U\362<\344\005\317\275D7\351<9n\321<p\230\005>(7j<\010\003\340=iL\331<\245K#\276\224 \305=#\032Y\275x\230\031=\375\337\004\276x\034\211\275h&\336=D\241->\350\2552\275~\343\375\275\342?\361\274\327v\334\275\233Sn\274k\0301=\330 {\276\307W\346\274nf|\274W\200\222\273B\025,\275^\342\257\275z\252\321\276\211\270\337=D\007H\274+\3729=\331?\225>\276\"f>\306\210\335=\021\224\324\274f^%<v.Q\276{+\226<\316\022\003\276R\022\271=\3601\323\275]\030\371\274\2472\263\274\373\227\t\275\23160>\0025%>\365i\010\276\331\tF\275\017C=\275\277\352O\275\000\253\201\275JS\r>\271\370[\275\"3m\275\351\017\323\275\2139\205=\355\213\214\2744\230\013\275\326\240A=s\340\323\275\262L\324\275\0327d>\3162z<\033\003\276\275; \332\274\344\247\335<\210\247\036\275\365\337^\2762g0\274\361\233\004\275/b\245=\256\221\016>\013\261S\275+^.>\324\233]>Yk\330\274\\\305\336=I^%>\'S\016\276\224_\031=\264\246G\276\263\n\251\274\026\000(>\224\n\246=V\231\231\276\363\335\t>R\001c\276\222%]>\363\220\205\275\301\\\207\275\016\300i>\030\000[\274\013]\236<\031\373\"\276\216\317\r>n\376:\275)0\210\275\340e{\276\341\376i>\210v\275=\343\013\244\275\254p\212>\324\322_>\311\202+\275\230\262\026\275l%\035\275\026\337\300=UZ\214<\375\002\335\275|\370\300<\37649=I\"6\276\177\354\224<,\343l\276#I\021>8\263\234=9+\027\276\354\364\016\276\007\212h\276\024_*>\007\322\341=\262<\220\275Q\027g=\250\372b=\252\tB\276\327\201\002<\355\323\255\275nF\314=5D\020\276\240j4\2744\017&>\23553\276K\347\007>\207\306\r\276ptV\276j\361\n\275RI\301\275\rkE\2763~\347\275\036I\302;nu\330\275\336\224\334\273\357\242n=0\'*>P\335\006\276\177\305\020>\244b\210\275\234\237l=D\311\212\275\001K+\276f\207\251\275\307Q\377=\344\351\226<\374\334\013>s%\226\275\"\226\230\276\010Io<\203\\\213=\277\316\214<\002\247\324<\220\336\312=\356\243\255=\007\260\324>k%N=U\306\n\275\307e\215=4\037\024\274\250x\207\2751 \211\274r\360%>\306p\t<\333\256D\274\216|\025\276\270\244\204>\203\3641\276\331N\177<\247\303\302\275\001:\321\276x\022\246\275Q\'\013\274\2727\201\275\270\010\"\276\372\013\353\275&\231\037\275\006AG>\245\225\375=D\251\207\273\027\361v=\272[f\275OG\255<\253\367\t\275X\223B\276`=\021\275\210w\202\275\"\230\212>9\001\006\276\201\365\322<\320\202b=\3336\317\274\262\004\305\274\324j8\276\025\351\221=\017\326\251\273\205\355\022>\205\305\013\276D\230\021=\006\037\324\275M\n\004\276\320\372\316\275\314<\243;%\212*>\037`\374=\024Z\326\275\272\"\025\276m\253Z\276\032\312\221\274\273\017\203\275\273\205\350\271\232Ws\276X\254q\276\202\036\257=\253\2545\276\223+~:\006V\276\273\240D\247\274\373\325\343\275z\202\023\276B\335,\275\010\3021\275\216\020\024\276\3626\343\273\242\274\270<J\363K\2752\344O\276\310\276\201=\202\205\177\276Ag\231=\271\311\225\275?*\313\275\367~\233=\225Ji\275>\340@><h5\276Qn,\276\021\252\n\275\213\252x\275\377\372F\275\\O\374;\230Q\364\273w\325->\271\004_>=o\202\276\261l\377\275\370\177\224>\351\017k=a\261\233=DX\202>a\003\211\273\002\340\341\275\344H\030<2\022\317\275\322\373\031<\346P\315\274\027k\021\276W\251\330=\033\207\227\275\301\237\377=#A\204\275\232\331\266\275m=\262\276S\357\202=\365\010c=d\345\n\276\325\327\242=\001GR\275\t\373\357=\201\205\003>\227\233\261=V\337\273\274>\327\014>\206\375\017>2\362H\276\374\336~\275@\365\272;\014\260=\275a\001\033\276241>\021\275\305<\020\356\007\276\311\3154\275\210\007\001\276qk)\274Hq\217>8\027,\276\r\337j=\300\277\200\275\250\0254\276\202\363\250\275\246\272Q\275\232\274\223\275\260#7>\205\302\357=\201\225\352\275\252\016\333\275c}\271<\016?\264\275\341\0060\274\003\203\013>\264\353\017\276\007\272+\276\377\024]\276Cq\332=\335\003\201\276\010\267+=\355\254\006>m\003\'\276\037\337\273\275\336\326\033\275\020\005\335=\317\374\017>\007\031(=`\330\274<(\013\206=\366\274i\276\265\214L\276i\033{\275A\253\032<P\003@>\257;K\276w\'V=\302\211\007>|g\261;\261*\277\275\221\300$>\277n\r\276\242\307,=\343>O\275}T\337=\237\325-\275\034\347\246\275\236\313\253=\375\310\351<\010\314\357\275\270%\335=\032\ni>\372\325\231>]$\217;0\376\321\276\203>\203\275&\273q:\2041\310;bK*>\373\304\r>\276\301\363\274\337\020\262\273\227I\200>\371`\277\275<\\{\275QB\355=\004\301\305\275\232\342\231=:BV=.HZ\275/\303\262<\265ED\276\317\202\307<\305c:\276\010(\345=\020U\264=\343\026\225>\257\240k\276\353\243\325< \366\200\276\325\226\335\275wld\276\375\360\263\275\376\021\274;\227\257_=\003\344\'\276B\365\003\276\202}C\272\306\025\345=\"\237\3719]D\307=\361Y\270\274\250o\230\275\276\250->]\355\266\275\024[\272=\367\371\014\276\365\2102>\214\345\311\275cRB>\375\n\374=\376\345\205\275\336#\030>\265w/=\316\224O\275&x7=C\254Z\275\000\004U\275v\017D;U\367i=n\260\024<%\027\253\275c\370\324\2759\271\r\276~\374\330<,\257\023=\356G\302;//\315<=\261\r=\372\252\214>\213\323}=}\331\240\275F\344_=\032\036\311>\202\337o=\321\222r=\370g\023\276\305-n\2764/\336\273\325Y\034\274x\341\221>\312\232G=\225\010\356\275\241\347B\275\255\237\032\275\367>u\275\227F\216<\033\ry<b\036\375=E\323\254=\216eh>N\373\r>Vr\215=*B\032\276\327\313\013\2766E)\276\350l3\275\317\336\352\2759\001[>w\343\014\276\305\375\300<\267\3568\276\337\206P=J\311\362=\260\252\020\275\021\026;\275\266&*\275*\rd<K\251T\275<+\305\275@\310h>\233\300\310\275\334\212\205\276\316_\274\274\255\235\204>1\361\010>\016O\376\275\342\345\217=\024P\221\274\311j\316\274u\200\227\274\000\271;\275Q\365\242\275\257R\273\275:?\377<\367U\275<qE\334<\370\355|\275@\037\002>\314\257\247>{\376J=\322\217<=4\331\017\276p\221\210\275AW\321\275\241]\365=Cq\334<\214\024\235=E%\000\2761\367I>!\227(>\212n\227\275Zy\251>\322\234\355\275\304\334\201\275\301\327p\271lc\353;\311\3353=\342\272w\274\276\205\201=f\321[>\215\302\277\274\277h\306\275\327\223\314\275f\252S>\010S\223>H\366\250<:\"\023\275F\023\017=\021\277\305<\004\236\274\275\321\223\035\276\016\0265\276\035 \005\274\213\035r=\014\006N>\243\3176\276\336|\004\276VR9>o\234\001\274q\203Q\2746\016E>>0l= oQ>\235,\013\275{\376\343\275\2340B\276\347j\257=\350\017_\275\365\005\374=\206\367\034\276\007\017I\275\253\0365\275N\376\023>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
