node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7740187
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\327Y\300\275\2122\365\274\367I\353=`(\206<\375/\016\276\264~\010>\205b\021=\350)\030\276]\037\225=\240\305\237<\372\276\006=L\007\275\273\346\000\362\275\321\205-\276p\030d;6S\036\276\323T{<\036\236\220\276FO\214=\221T\306=\266\n\351=\261S\017\276\025\326\320\274\273$\226\274\303\355\334\275n\225\201\276\330\207\221\275\305\307\245\2751\333J>.&:=\243\353\220\275\257\244?\276\033\025\\> ~\022>=S9\276[(\014\276\000\022\213\275\034#\272\2743\267\2229%9U>\256\212\222=\226*@>\303k\000>A\233\032>=1\237=\346\013v\274\373\336\274\27444<\275\223\373X>\257\256\016\276\257<~>1\327\030=\201\'\333\275\211\226\003>U\020\266=^\311\331=\272\215\311=W/\210\276\3225%\276\232\213\332=5)\365=\362\364\213>\026\021\271\275#u\004\276\225\325|<\254\032\n>\256\'\013\276\335\360\222=\274\237\204>%g\026>0D\026=\377kr\274\007\243\225\276\177\006\310\275\327\267\251\275\326z\352\273W\'\034\276\251\000.\276O\007j\275\246\231\234=\0219\204>\276(\274\274\322\231\204=\003\267\032<x!\323\275\010\312\205>\362\2229>y\265\275\275AP\371\274>\215\200\275h\230#>K\302\261=\005\347\211\275f7\366<\354\017\277\2755u\355\2751\3508\275o\215\276=\260\336\017>\366\014^=\220\016\221>pHb\275UY*>\365\247m\276\2747\332=\301\224\333=wQ\345\275\227\'\376\272U2\231\275\350\274\331<\214Q\222\275|<\004\276\376w+=4M\347<rT\003\275\030\375\337\275\247:\373:\353;\355\275\036\2633>\207\003\337\275\333\233#\276\214#(>S\375J>x(\234\275\370MZ=\206.\036\276\324\220\022\275\004\032A\276\375j\006\276\006 f>\213\371\213>\233>i>\264S\324\275\273~)>|\221\035\276\344W\301=Y\311\374;\010\t\275=m\376!>};O>\344\017B=\240\235C>\263#\323\275G\205E=\005_\340=}\267\010<\253>\r\275 E\327=\352\005\274=\336n\021\276Z\262\354<\344\331\216<9\223@\275,L=>\234\244\017\275\352\336\032>JW(>\252T\353\274k\373K\274\232!i=\215\236\322=3Z\262<_\n\020>\371 $>\263\177\356\275\007!j\275r{\001\276\370\025F\275\317\203\376\275\261r\212=\304<)=\241\001\035\276\221\302\332=N0\275\275<\376\235<{\364\230>\024@\213\275D\372\254\274\211\233\022>8m0>\225\355A<\007\003\030>\023\221o>\211@\262\275\224\300\221<O\370\267=\262\314\372\273\261\016\356=\364\307\262=0\273\333\274\313\341z\276\306\265\223\275_`\244\275\243\347?\276a\024\234\274\027\303$>\366\224M\276L\263\204=\321\321\312\275mC\003>\220\270&<\264\240\245>\2421\030\2764\030=\275\031\317\035>\021M\004\276,P\010>\317\257\'\275\316\320\371:w\231A\2754r{=\307\177\220\275\013\023\275<X\027\t\276\377\267_=\204\215\004\276E\t#=\347^{\276\365\235k\276\324,\272=\365`\325\272(Bz\274\302\333R\276\243!:>\315h\007>\356\3113\275\367ir\274\312\"\036>\277\203\004>L=$\274\007#\332=\247\240=\276\331(-\276\310L\254\275\336\370P\276%\343}\275M\030k\276\306\271z=KM1<\374;\002=\3177\004=\252\272\\=\000\241\303\275F\213S\274#\340\210\276@\331\022>\311 3\275[\010\275<\250\237\216\275\360\373[\276\013o\030\276\246z\003\276\374zG\276J+\226=\323\375\021>\323P\340=G\350\244;gS\350\2759\332C>\310\013/=\227\237\374\2759qb\275\257~<>\243\220\006\276kB\276=y\206e\2758M\325\275\274\037%>Q\262\351=\351\234\257=\361\275\326\272\252\207\213>\207\373\023\275\235\007\367<\363\260J>C\310\301==\305U\2760\225j=\253dW<\304\345\243\2752\"\261=\333/\376=\247\003\007\274\257S\317\273!\245]\275\314\335->~\312\353\275\022\333\226\275\351\247\307=!\270\000\275\225\361\216>\251`}\276h\313\341=\206?u\276\376?\327=W1\365=R\003\230\275\000\245\034>\371\371\342=\357\231\260\273\304\326a\274\226\031\236\273\035\2002\275k]\246\275I]\246<\013G\241\275+\375\024>\022\366J\275\0366\253= V\346\274\024\356\222\275{JS\276h7\334;\\\356\304\274\214M8\276&d\300\275E\212->\331\005\021>\014\216\004\276.M\351\274fx=>\373\364\353=}F\346;\326\025\221\2742\211\215\276\237\026\001=\311\356c\275\035el\273\320\307\030< \002\221\275N\234\347=x\303\327<\225V\007>\023\242\361=\276\303\034>\204&\340\275HQ\313=\247\376\033>\265\263\300=-\274\031>\014\017V\275\242\264\000\276\360\374\010\276M\266\202=\344rk>Y\'\265<\304\267\231>\315\324/\276\376*n\276(\217\301=0\203i>\371\210\306\274.s^\275\345\260\261\276\225\360O>i\274\013>m\'X\275R\301\005=\244\255H\275\376;\273\274U\t>\275\324@\007\276\314JI\275M\372\211\274)\205\203>\236<\216=(3\243=\260\023\370\275\2211+\274\246e\261<b\037\010\276E\251]\276\255\312\025\276\001\034\245>\227\347\354\275\245\"\246\275\031\264\223=\224\355\351\275W\r\234=\371\020\270=z9\301\274\307O\217=\207r\237\274{\225-\2751\017q=\nd1\276\004\217\350\275X\003\331\275~\315\275\274\007\274\375\275\372\3302>\260\034o;\210\2702\274x\213\355\275\375p\323<\334U\177>\260\261\314\276H\375\371\275\335j\206=W\313%=\033\342.>\335\2413\276\2253\204=\347\306Y>E\222\366<\237\006\353\274^,\225=\301\362\234=_\021\016\275\300#\314=\245u8\276\r\201\031\275\001\314\253\274\324\253\236\275L1\021\276=\353\250\275\016\\@>\251i%\276a\207\221\275\312\323\261\275\370\377\022> \226\023\276&\314H=>Q\227=\311\220\212>(\362\026>o\231\n>\377:\376= \333 \275\255\356\210=*\3575\275\261\225$>\326\344\221\276\377\n.\275\276D\000>\245\232\235\274\216\271\264=t\'\356:\004c1\276\363\034.\276\221\022J\276\216\352>\274\010\037-=N\034\"\276\335\231Z\276\351{\363=F\206\222<\254\362\226=@I\237<\327\346A\275a!K\276\322\1776=G/@>U1\316\275\004\030A\274R\267\346=}~\354=\330\335\017>\310\013\255\276T2\247=\305 5=tV%\273`\212\210>\363\270\331<\216)!\276\t\377\315\274\273nH\275\353\016\036>\003~~\275\334\363\032>\367R\366=\214\214*\274p\300\004\276oD\t\276\027\0141\275\236|\262=\255\331\362\274\303|\353\275Eo\220=\207{\217\275\032\311x\276\221\247\244=\n \370\275WD\323=d\3163=MTK\275\001y\n;\323;\020=\223\324%\276\214HX\276\302\266\215\274D\032\007>\340\206>>c\244\376=\026\r\327\2758r/>\231\352\006\276\244\355\356<\016pV\276\034\r!<\364td=\252k\356=z\t\227>\256\245\034\275@\021\014\276:\272\213=\335)\267=C\234\205\275\377\311\241\275\362s\205=\013;\366\275}\347\222\275\312n3>\272\322\035\276\337G\355\275\021\350\034=uJ\r=\225l-=%\251\214\275\002\303\272\274\0135\245>`\252\204\275\307\312!\276\225\014\333=\217\340\260\275\355u\222>\355\263X=\013\331p\276\036M\267=jc\024\276\022\200S\274Z1\t\276\363/\365\274E\226\224<^\214[\275\201+\217<\344j\373=\026\244=\2763\0225=`\035\r>\257\336\266\275\355\313\271\275\371Q\354=GCq\276{\013\220>\213\024A\275B\244\r\276\245\002\016<+\025\321\275Xk\240\275\277\243\323\274\220)\021\275\300H\210\274\237!\201\275\211\2311==\216y\2768-?=C|^\275\364c>;:\372\315=1\225\334\2759\203R=F\211 >\013e3=\302v\016>\350\314\222=\276\020\220\275\006\005\016\275\333\266\215\275L\302\237>\270\230c\273\2174\210\274T\3531\273\237\266V>\226\277:\275\311\374\315\275\306\354\320=\274\'\320=?\267\027\276\223\177\314=*\034\243>\277\247>>\2771\013\275[\230d=S\000\033>4o\215\274\344\263\357\274\363\252\242\275\304\374<>\037\237\226=[\032w\276R\3422>\016\211\036>7vI\276\230S\035==C\376\274P\236\345\275:(:>ukk\275F\267\016\276\177\261\360=4\316\244=\366\"z=d\303\304=\360xe>A\372$\276\261l=\276]\325\357\275\370\276\345\275\366m\257\274\035\014R=\016\004\373\275\325\n&\276\252\226\231\276D\357\274=mt\026=k\371o=\010\220\030>\177\270\025<5R\270==|>= \344\376=\350n\211\275\243\347b\276W\324\252=\217\031\221=p\254\202>\372\203\006;v5\233=\266\004T\275\317\376T\275\333I\245\274\340V\367\274EM\263=\200i:>\310\355\024>Y\243\262\276\033\217>>\376\216\213\275\t\254\202\275\315.U\275t\321\253<\013\240b<]\220\033\274E\200g\275g\325\216=\246\273\257<\206\263o\276\tf`\275\007!q\276g\263t\275\267\354N>\322V\034\276]@\213=\262n\371=\224\352\212\275\302U\233\274\026\017$\275X\264\276\2755\275C>\271\267==n,6<)\263\364\275\375\033)\276Yr4\276\304?\020>Tk\r\275q\361\246\275N\221\336<\0225\230\275q-e<Vv8=\264R\330\274\270\320\026\275\314\324\n>\326\365,\276\004\201\000\276+\023\200=\r!\033\276\333\217I=]\256\014\275\307S\241>\271\250F<\335\315\r\276\246\003x<1%\346<\233\371\221<i\362#>\350az\275Bv.\276\356Zb\276O\"\006\276\254\255\317\275\354J\243\274\302\032\202\276gm\256>%\230\207=\215\333\211=\006\375\203>\230nO\275\013\246G\274\177\331\005>l\337\317\275\3717\333\275\250\227\335=\320<\227\276Gw/<\207x\212\274\216\247\036>\355\235\257=\034\207\204;\223\035\266<%\212\246\275<?Z\276-\\ =\231\374b\275C\354e>Gq\332\274\304RH\274p\3378=?\002\210=\367\264i\276\303\274g\274\016\344~>Y\033\031>8\030+>]\266\211>?\266\304=w\305R\275i\363e=x\245l=\330\2325=\317\320\334\275\336\002\220\275>\214w=\223b\001>\376\307\350=E>\266\275\335\335*>\253\374[>D\r\371=*\356\013>E\332\241<\311\357\034>\305\351:\276\336\2176\276\311[l>\307\020\002<\010\351\306<\375w\263\272\362\273\351=\023\270\374\275;\304\007<\211J\t\273\345!\n\276s\027\256<~\342\216=\214i\227;\315\211\006>\353\251\013\276\351>\331=\021^W>\221\t=\276Z\013*\2730\251\377\274Z\204\255=\244\301\013\276\r0\337\275-\314\037\276\'7b=\332\351\t=\345\216\024=\000\356o\275^b\217<\016E\014\275\265.o\275,?\334=\366e\315>\223\221\"=\215\213X\275\252FN\276\344\306\226=\013H\334\274\t\2278>|/I\276:\336\000>S\253\257=E\324\265\275\321\227\312\275\306!\244<g<K\276\372-\371\274\265L\310\275Q\310\001=\250l\362\275\1774N=>l.>\010\037\333=}\244A=x=\205=&n\367\275\244\302{>\212Si\275\355\202,\275\006\353\017\276\344\200j>\324!\256\274\350\353 >iL\322=i\271%>(\336\027\274\356\0304>\247\325\265\275Jve>k\351\217\275\"iL=\331N}\274\021\343\271\275\\\303\004\276}\245\325=\025\026H=\360\270\010>n\260A\276\260\275\017\276\300z)>\026\302\270=\004\023\003=\021s\231>\n\366$\276\026\361\231\275p\355\264\275\007\350I>\034\206\324<\200Zf>v\261\234\274\366\020C<\245\357\200=\345\033?\276\222\251\233\274\203\270\273\275\313M(=\033w\271<Y\374\026\275\324\037\3619\245#\342\275\352-V>\035\275o=_M\222=\245B&\276\003\220\304=e\267\266\275ab\275=\352\037,>R\0325=\213\026\374\274T\374\\\275\221q\222<\310BM=\023m\023>\335\207\321\275\315a\027\276\227v\'\276:\373\002\276\030\247\305=>\222\275=Y\2533\275\\!\232>7\321\277\275\252\211x\275<\323\306\275\213\215\017=U\033\272=P!\302\275v}<=jk\266=\351B\252<\234\373\267=\004S\250>wl\240=\360\337\235>\366\277s<\324\252\375=\346 \237<\234\337l=\240^\267=^\003\000= x?\275\376\347\274\274v\211r\275<s\217\276\217\017^\276\260\345=\276\205\2335\276\t\337b\276\210XT\2765\261\256=\005\271/=u\230\205\275\213\237D\276\243.\323:\372\237\327\274+\372\007>v\031\004>\005\026\272=s\367|<|%9>\274\341\">v\361\233\274\00422>\215\017c=\037\250h=lI$\276`\327\225\275\231\215p>\357\217\214=\023l\250\273\030\307\303=\014\177D=\361\217\331:C\022y\275W\306\021\276\261B8\276@\006\217\276@\340f\2765\362\001\276\310\371Z>\007B\033\275\3728M=\365\362S=\215\320\013>]\226\245\274\275\242\232\276YZ\237\275\244\331\255\275VGB=\217\306\001\276#4 <B\317\312=\332\273\273\274\2712H\2764u%>0\354\237=!\003\370\275\221\276\202=\203\225\203=\224\034\013\276\255\213\316=\306\343\247\275\321\337\234=S\207`\2746\350H\276\034\354n\276a\365\276=\364rW=M\313\302=\013\366\206\274\325\3219\275\203{\231=\336\n\374<>\310\236>\231|+=\364\240\334=\352\374B\276\n\204\035\276u\252&=^\346\017\275}\000\243>\215\243\326\275\344;\223\273\347\033*\276\365\003E>`X\375\275A\221\215\275\214`\344\275\320\276\224=\035\204<>\252Q\372\274o&\270\2758A\013\276\014.|=Y`]=\357d\236=~2]\276\330\3768\275)(,>\351\364\026=2V\t\276\225>\354\275e\366[\274\205\017\205\275z8\210\276\021\304\251=\207\032\n=s\361\216\275\254c\020\276\340\236C\275l\013\376\273\021\200\345=\365O\235=\330\340-=M!\006<t0\250=\325\303q=\325\365\256<!]\202\275\365\223\210>M\006x=\204\336\031>,\304\336\2752\332\177=^\240\255\275%L5\275\331\377Y>\226x\205=\255\307\270\275@\372\350=+\267\341\275\221x\353=_&\315\276c\352\n\275\225\3314=\000\"\301\274\203\201\327\275\223\335%\276\'\t\036>v\370V=\330\234\354\275\201Ks\276\323\335\272\274\207\251E\276\\X\\\276\363\'\303=\3513\270\275\206\243\017>\222\331\203=\'\010 \276\217\343*\273\032@\256=\274\023\026\275\246\203\006>\216=s\274\327\2408\276\036\261\367\275\310\'\247>>\3276=Nf\266<.\257D>\221\316e=\260\271\020>\"\030\032=:\230\013\276J\205\017\276|S\376\275r\365\200=\3542\r\275\352)\371<\233\274\336\274\350\335\000>\351:\253;AO-=\001\360\373=HN\177\276r\023P\276,\322\357\275\254V\032\276\322\2553\274\007\345\013>\217\262\264=O\020T;\373\234\216=\024tc>\357\204\327\275\340\255\030\276\315\252\206>\027\372\034;\231\3175>\210\010\311\275\032w\304=\342\235`<\235\375w\275z\334%>\037\373\223\275>\364\006=4\227\252\275\274\r\001\275\032\2428<\273\336Z=o\372R\275\341\276\366\275\347L\317=\372\3117>\005o!\276|\221\266\274\020\277\276<m\367S>?sM\2760X?>L\263\345<u\330\333\2740\037\265\275\311lG>F\024\034\276qI\334=\024\217\313=>\375\334=\256-\223>\341\235\007\275Q\272h\275\357\376\026\276\035\377\210\275\277\341\304\2749\352\332;\245\371H>\025\033\361<\361\366X\275\243\351L>\252\352\014=\307\3220\276\370\200E=\023Y\372\275\357R\354<\275R_\275i\277n\276\234\316L>\314\353_>~\371&>$\352=\276\250\243_>\001\202\273\272c\323v\276\237!\330=\362\263\264<B\234\237\275)_O\274\324\r\005\276#\206G=\010\344\004\276\361\367\221\274t\227\020>\205\352\t>\222\376\255=j \'=\356\214\312>\220\213M\275\235\342Y\275\275\211\'>)K\340=-\017\010>\007\323~\276T\027 \274\020\343\224=^\336\255\274\276\322\203=\2471\306<\271\200\235\275\370En<\031\234,\275(\3751\276tK6\276\245\334\277=G\n\032\275\267Y5\275\216\346s\275\223\\\327\274p\346\363\275\303\315>\275\325-\374=\361\2642>\022\356\315<\235\nL=\"\257e\276\260+V\275aF\256\274.\013\344=\255!\032=\037\273\003<\013.B\276\313p\031\275\222\223M>x\023\017=:\016N\276\347\210t\276\276\033\203=\307vN\275q)\030>\217\331j>\304\227\332=>\255\364\275\363\204\024>I\251\350=\261Q\030\276f^\374=,K\265=\221\013\034\272\255\300\030\276\251\3654>\303\214\244\274\025\334\352<Z\320m>.\255\322\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
