node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 3044890
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\254f\313\275\234\365\246\274\324Lb<\375jy>\232b\001\276\244w\204=\341\274\242=\220~~=\233\275[;\274\312\205\275\3700D\276\376G\266\274\350\237>>\311\\\302\275\036\032!= \305x=\233l\355=\022\371\224=`\347\374=}b\"\276\342:G\275Q>.<W\305;\276e\\8<\345\277\277=jtX\276\226\016\211\275\323\333o\276R\301\251>\261\356\000>x\021Y=\316\345\233=\002yN\276\1776!>\203\370\243\273$\214 \276q\366\240=\"\271\200>\217\020\232=\331Z\241\274\325\264\260=\321\316,=\375\003K\275o\205\222\276PGt\275\374\3657>Z\035\210=9\026\004\274t.\231=E?\237;\010\262\354=\243\347*\276\324K\216\275\311r\245=\363+`\276[tU>\377\214\273=\253\340\245\275\246\206c=ns\177\272i\206$>\035G\223=\355+\227\275\235f{=\354\276=\276\340\214\325\275:\345->\321\307\013>R\252>>\345\352\267\275\025V7\276a\332{<\302\267\233=h\010\223=\302\201\334=S\000\207=\210\242\014>\255\260\322\275\026\326\005\275Y\344\006>\212\210>>\367\353\250=\223\366\r\274\371=\364<eR\204\274k\177\033=T`\027>\243\207f>\253\262\351:\034.\036>Oy\307=\211\273\005\276\274(\326=GeH\275\266u\237\276*mz\275~_3=\345\236\204=f\323\211=\025Q\366\275\317\035\326=i9a>\213\221\376\275\005\036\244=E>\315\275\2004\254=\365\262\236<>\324\035\276\206M\206\275(\351\353\2752\036(\275\010\362\207\275tI{\276\341\"{\275\241\355\265>\245\353\352=k\327\000\276\221\023%\276&\371\370\275\376\334\221=\322\0019\275hI*=U\271\206<y|^>M\210\036\276$\236\">\342\316c\276\037P\253\276J\273\337=\212\230\317=\253{\251=\225\201V\275\223\023P\275V\332\010\275\274\230\210\275Z\370\241\275~\256\261\275;\r\207\274\214\264\364\275\367\274\215>\271<\206=\350\002\031>\251\343\231\275\377\031\224\276E\326S<\356L*<eB\007=\035|\343\275|\354\341=\303\277O>W\3358>\371\225\222\276g84=T\n\217\274\257;\272<\211\303\233:\342\235\2679!i\320\275F\230\'>\353&$=\333\2746<\336!9>|\374;<\221}\214<\375\244\223=\n\266\010\274\003\312\202=\225h\277<X\247\035>\301\311\221>\226\265\010=@+\324\275\001&\316\275lV\374\275\003\026;\275\202s_\276\266\353\223=\\]]\273\274\375m\275\321\267\324\275\332\360\341\275\036\241\250=\310\022\000\275\252\317\216;A\001e\276\205o\207=\313\227\025=<K[\275\203\222\177\275%{\203\276\352\245q\276\367\334\225\276\372t\200=\323H\377=c3\217\275\tU<\276B\271\"\2756\205\036\276\"Ok<\361v\332\272\3517\205=P\304\367\275\310\202 >*[\304<8\006<\276\031\'%>\3523\033=1\032\302\275\260\305\215\275\206\222B\276i\305\317\275\303%\355\275~\330\007>\347\001R=\210\324h>\'\217U\274\366sD>\345\rw=,+F\275B\371\306\275\355\371\020\276]\202-\276\242\243\037\2740\237\002\276\032\3438\273\006t\212>Q\212W\275\270\034k=\243\016\371\274:_\375=\014\240t\275\335\342\314=\330\325l\276\325\226\371\275\230\350\310\275\214\025\312\274\263P\277\275v\222\312=\324\206B\276\355S\001>j\265\222\275\000\245K\274\243*\213\276\3770\004\275\247\231\216\275(\'B>\260\257\245\275\233\026E\276\034\366\302\274\252@8\276d\250\235\276\261H\230=\265y\000\276\310\320q\276\023o\255<sk\304\275oC@\276Z\315\360\274\223\'\200>.\251\263\275#\307\344=\217\363,\275\247S\225\275Xy\366=\017\342\260<\210X8;\222\336U\275\025ab>cA\361=d\214?\276\271\216\036\276\374=\261\275q<#=\243HJ\274\317\3259=V\025\331\275Y\350\345\275\037\303\255=I\331\024\274 2\034>\235\027\363<f\271Y>\325\337\373\275.\373h>\014m\227<o\267\025\2761\357d;\023\213\316\275I\255\367<\206\233\250;\006*0\275S#\202\275\271E\214>>\244\260\275\335\220\232\274\236\303\240=,\020#>\376\363Z\275\265Z\020\276[w\003=*Y\346\275\227\330X\276\376\277\036>\315\221\353=\034\013\245<\005\365\255=wKW>/\371\377<\013Z+\276\324t\264\274\215\335\007\275\021\375\031\276\0252\267=\234\263\334\275\222\365b\276h\325\236\276\002[\275<&\232i>N2\207<\362Bq\275\226\376\355\274C\214L;\373\017\230\275\251R\306=\304\375\027>\007s0\274\261\006\010>GZ\224\275\262\310(\276\237\270b\275\242\202\001\276%e\313\275\367\273\202>l`P>\037\360\357\275\203\374\366<\"\204q=K\377\032\276\332\022\177>\342\355\225=\004\234,>\216z\022\276\310 \252\275e`\304=_\221\333=\246\303\n\2766\027\255\275h5\007\276\314\261\303\275\001\024m=\271\nQ=\374\3675\276\367~H\275`\267\271<[0\375=\206\371\226<G\211\305\275\263\261\310\275/\022\013>\324&\"\276\274\364\211=\275\250\021\275Y\203^\276#\002\035>]\250\177\275]\036\016\276<r\213=\332T\037>\366\311\020>\332&\002\2768;X=\214\274\202=,\223\034\276\363\211V\276=\343\312\274%\250C\275s\322\245\275ky\"\275J#\313\275)\326\302\274\205\344/\276\005\324\205>u\216\342=\026\251\222\274\264\344K<$Q\021\276\356\247\204>\334\307`\276\031W*=\256\356\256\276\002\252\221=\303?2=\005Y)=&\224\021\276\252\261,=\371\310\032\276\277\360\247\275?Bl\275\020\362\262<\303U$\276\234\335\325\274`\223\336=U\313\262\275Wk\267=\265\360\264\275*\242\002\276\'C\376;\207\246+9X\271\245<n\331y=\363\016D\276DSQ\275-1\030\276\260t\002<\341\325\014\276\023\367\n=f\327\344\275\037?\204>\003\262\202>\006\271i=B~b>E\344\361\274e\275/\275\335\347#\276\270\326\324=\300\013\021>fR[\276\331\226\227=\022\016!>\221\330\317\273#\277z\2759\311\201>\277\227,\275\327\263\363<\323\345z\276\213&-=Rz\331=\3159\332\275\304s\230;\267\255\r\276x\354\305\275\365\226P\276H\267\325\275\235\271\347\275e\'\266\275{x\220\275\371\301n>\276\212B=t+\210\275\252;\214<9nK\276\232!\227\275]\234\276=rN:>\201\305\202=)\240\302=R;H>\267\313\007>\321\332\2118\232\020\234\275z|/>u\314h>\023\331g\275\\\243?=\025\326u>v\323[>c\376&= \017\371=\003j\305< \245\250\275{\014\236=\017\341\010\275\203%\022\275\257\223\262\275S\027\352\275\276.\014\276Lx\341\275ct[\274b\225t>\004\024v\274}s\022\276\325\024\335\274\320Wy=\205\310f=\317\\\371\274/\267\202=\232\010\203\274d\212\273\275W\035/\276\250<\205>\342\245\245=\267\330\034=\315n+>\007>\030\276\37380\276Aa\203=,\021h=j:\233\275\256&\272=\3602\315=\035~\t\276\201-\'\2754\177\240<X\n\370=\027\003\207\276\213\021<\275\351\300&<\254\222\314\275:\312\t>\251\246+=W\361\226\275\002\3564\276\"\305\373\274\013\371U\276!\177\272=\033\032%=U}X=m,>\273\030\311f\276w\207\273\276\017,M>t\307\200<d\232\277\275\314A\372=\362\233x\276\037\234\025\275\3067\221\275\034y\'>\277\332A\276IBY=\246o%=\031I\002\275\327\326\033>\367&<\276\230\030\">\333\010F>?\302\264\275oN\337\274\274-\n<z~ \275\265\237u\276}\335\314=\340\251\246=\241\375&=po\\\276\240\333\\=\216\025Q>\3274S\276\004\257\034<\271\206\n=\366\'y=\263;\274<B\377\206\276\"\350G\275\232#\262\275\335\tu>h\335\037\276\361v\010\275\031\230\234\273$\034\342\275]\255\207\275`\271 \276\365\024\270=\362W\345\275\036r\032>=\216^\2750\010F<\327gT\275\367\022\r=#1\311=|V =\013>\020\275&\252\324=\245\256?>\234\314\347\275\027\227\241=\270s\250\2759t\272\275\353S\240<\243\"4\273\204\237/\276\263\003[\275\340\274\377\275\376\213\373=\007\035\034\275\334\tS>U\010\370<_E\013\274QH\337\274\006\217\304\275\334F\276\274\325\306v>\3245&=\205 M\275?\031\357=0;\304=\022^\227=$\253\331\275\314\233\256>\024\267\243>]\246^=J\264\342=\242\317\013>\346h\232=\270b\007>\2512k\275&\343\364\275\274\324\243\274\'\007A\276\\\354\222\275w\220\242\275f\310\006\276N\252\337=\336_\205\276\235L\230\275]\334\355;\3346\232=\206\\\262\275m\303\200\273t\214Y>l\230\214=\374\264\307=\277\374\302\275\0350e\274\033\243\274\274y\214\032\276\201~~=\315\250\274;\312\374\270=\254 \237=\333\n\310<\3456\376\275\365\357\302=\273H-\276i\303\027>\224i<>B\032\216=\272[\035>\342\272\344\275T]U=\373%\343\275\024\245\227\275\215\374\036\2761\356\317=KJ\215=\"\230C=\021\200l\2748\307\230\276\224\032\033\276\322\035\243\276\014\254\266\275{\036\254=\201\341\203\275\261\300\254>\301\302\203\275\256\022S\276\336\215(>\352\340 =\016U\345=\256\n\223=h\253?\276\001\341\210=6\376M=\256/\010\276\265oc>\324v(\276\273\250\232=\025\215)\273\0014=\275e+\243<oC\301\275\215\354\207>\203\215;<?L)\276\233\361(\275\\\371Q=\224\225\337=a5\336=\217K\330<n\014\200\275\324\360\367=\320\334\331=\375\201\211\275\373C\253\275\333L\235>l\345\230=\000\314_\276\274\024\273\271K\310\235<\271\245\274\275B\252x\272\373\034$\276\",\211>Kk\203=Y%\000\276\234@\334=\244\333\317=\354\273\263\275\277\036\037\276$\311x\276z\352\263\274\274\220\336<\037T\027;~_O\276t\205L\275\210\355\376<\351\207\021>\276\217\205\275\267\310u=\246\351b\274\014\023=<\t\340\371\275)IK\275\254]r\276\271\327J\275\200u\327\275{4\211=!\332\232>\230K\037\276s\317\326=\254\006\317\274\322\2203\276\330\360\361\275\256\256\255>\336g\005=rC\207>\250\227\277\275\2178\353=@\356\036>3\214\312=\232,\213\276X\235\033>\2664\003\276\243\374\002>\021\210\251\274\236\270`>\353\2370>-\"\262\275\223\036\245=\251\244\025>\367\300N\276y\312\347\275\362\371F>>\370\201\275V\300\202=\327\377W=\033\330\337\274\353,\313\275^\225\242\275<\224\314;6=\202\275\232/\332\275\347\223U\275C\004\216\274\223\022)\2767\264\023\275O\025\'\275W\351\t=g\242%\276b%\261=\221\231\022\275\217\326\234\276\200\221\225=\337\201i\2750\323\375=\231k\326\275\340U\010\276\254\323\034\2761\312\030\276K\275\026=j\234~\2754\212\010\276\327\257\317<OP\326<\241p\325=\253\031\243\275\343\275\223=\302\\\030>\373\222F\275\364J==y.\370\275\263\034\331=\231\206\246\275\206\276\006\276\017Wx\275\025<>\276@]\017<\007[\227:\001b\325\275\002\010\225\275>\341Q>\204*\251=?\000=>*\213\010>\330\244\001\276\324\266?\275\376eg>w\2676\276.\360\220=\316\357\346\275\253K/\274\234:\263\275\003\030\231\275,\347\273\275\265\353h\276d\213\254<\026NF\275\r\321I>\n\"\032>\245\312o=\325?z\275\340l\212\274\2717\007\275YBE=U5\342\275\373\303\007\276\300&(\276#\212\266=\005r\025>j?\367\273\025\204\245\275\307\330\326\275e\337<\2768\311\030\276ml\234=\"0\037\276\244\024=\275\262\312;\276\206_Z\275zN\254>9\017\222\276\260R\313\275\362\270k=\036\350#\275\242\021\355<mL$\276\237\257\277=7[@=\266\205]>\017u\225=\366\000}>k\270\243\275\350|S>\263%\030>fn\202\276\3374#\276\215\337\233\275\256H\036=\002\323\232=)\372\225\276b\371\245=\2158\343=7`\363\274^\203\272\275\370\317\033\276\'\031\201=\214\014\316\273\241\256~=\364\275\020\276lv\n\275\001\006,>^\276\024\276\234\275F\276o,\375\275\3556\214\275 ^\260=n\251X\276\320Q\310\274\n\325\267<v\307f\273R\211\333\274\326\241\315\275\262j\034<w\024\302\274\223Z_=5\374R\276\036\2708>^\241I\275\203}\177\275\\,\330=n\326?\275\3241B\274\307\321\277=\344\371\226\273\315\300\305\274P\243O\276\237\317-<\323\213\237\275\267\025O\276=\341U=X\006\226>\347\217\016>\205\3105>\006\224\307<\247\337|=\224\246\007>\351\231\376\275]\235Y>\311ik=\242N\240=\314E~={9\305=\357\314\021>\370\326m=\004\007\037>A\334u\274Q\225\220\275qR\032\276\205t\223>\335\341z;|\200\323=\241\035D>\253\314\245=\211\177K=\016\341\001>\360\224\353\275\005\031d\276sc\240=\211H7>\337\330\202=\311*D>\030C\232\275\321HR>\224G\t>\331\353\003>\207\326\374=\336x\372;\242\001\021\276>W\227\275S`\214\275@\360\177\275\236\214\201\276:K\207\274ZH\005=\354b\230=\003\006\367\275l\307\312\275\003\255E>S\245<>\300\020;\276NM->\000\317\000\275R\372\342<\237\351o\276\351\210\315\275\310\303\245=b\026];zM\024\276c$\r\276\254|\230\274\315\211@\276&\347+>\036_\024>\265\360\022>\t\240\372\273\177\314\002\2741e\237\275\310\005\244\2752>\004>Jy\232\275\263\327;>\313\0269\276\252\262,\276\365U\\\2756\023\253\275/x\027=\317\233_>\346\213\306\275\223\246\264\275:v\273=\201^\001>_M\357=\223{\252=\340\006\245\275\243\275\010>\315\327\334\275X\347p\276\255<\n\276I\211\262\274\317\213>>\221u\256;G\244s\275h\272\253\275\005\225\212=>\214\203\275\017\322\026\276T\037\254\275\002\007\017\275)\334\257\275a\351[>\177\310\265=z\177\323\273\264p$>^m\232>\370\261\375\275t\\n=$\321U\274L4\315=\200\026\204\276\331G\007\275\266O\267\274&\020R<\375M\242\2759\005%\275]\360\206>\253l\000<[\365\370\274\353\205\271<\234\335\010\275Qy\330=$v;\276[\356\313=\234P\252\274\264L\022>\253\321\351\275\343\215}>\316\022D\275\234\n~>\350\031\324\275\230R\322\275\r\220\357\275\3279\007\2768\332E>\257-@\276p\273t<\314\014s\275b\317\003\2763\2601\275\024\032\332< \337\266\275O\256\205\274\202\217\021\276\207\263\261\275\271\301(=\345\207d=\036c)\275N\326\236<G\376\277\275\346Q9=\200\021p<\215%A\275\341\310\323\274br3\276#m\275:\257\3677>\321m\332\274\354\375\027=\337\005K\276\372\364\330\275M\017\003\276;\213\307=\021\262\331=\270s\3678\004kf\276)bR\276\371a.>\262\254E\276\363[\313>\271g1\276\200\004\320\272\037\274\016=\267\004\246=#\3606=LH\004>\337\376s=\336V >J-\030;[IE\276Jt\001<V\023\303>\264n\">;P0\274\345\256g=Um\331;\235e\252=\242\314\322<\025\234J\276Gd\353\273g`\324<\337\307\202=\252,,\275\340\263W\276K\335\200\274\323\030!>x\013H\276\356\360l\276\016K\\\276\302\203\006>\036*\323\275\352\362\351\275\026\223\374<\332\222\363=\271`\361\275\032\361(\276\262\033\353=Z\305C:\037x\331\275\267\256\004>\371\312\305<|\"\\\275+\n(>\247/\357\275\247\270|<,\363\220=@o\342;xi\250<\244\376\213\275\233\341P=\255\374y=&ou=6\325\265\273+\343\204=\276\301\371\274s\254#<\215\232\241\275\031\3012>\245\346\"\276\246\353\010<a\363\334\275\306\314/>\220\357\347=s\006\177\275q\261\355\275\312B\274\274Oc\033\276f\r\203>#J#\276\007?k>\010~O\276U (\274`\212\021\276>\373\242\274\266\n0\276\321a;\276\376\023f;V\246\217\276\371q\240<\365 2\274\032p\206=\027.\213\276?o\325<\024vz\276\345!\306<7\0345\276C\343\217\275\346\272\314<Q,\203\276\365\272\353\275\342\377\'\275\211u\334<\300:\352\274:$\231=L_\327\275D\265l\276\013\034\216<O\013\376<\3735L=\214\036\203>@yy\273\240\313\266=\2258\203\275H\024\203>Z6(\275\024\354\331=\233\327W\276M\231\t\275=\002\216\275ig\301=\267\256J\275\023iq=\373\275\017\275\366\232\205\275\013\022&\276\242m\027>A\252\000\276\204d$<\337\367\211=\212:\353=+\033^>\355e\215\275\237\r(\274\222\257\\\276K \236=\251\271\307\274Y9_\275\030\177\221\274KP\n\276=\273\000\274\343\215 >\373/4\275\030X\375\275\273\2079=E\312\237\2754}U\271TGS\275Zw\017\273b\030\210\276\230\2066\275$`\216\275\374\265\331>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
