node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 3483892
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\340\337\002>\000\322\274=9\t\025\274%\344H\276\373\264\264\275\314\224\304\275o\255\276=4\r\007>\200\355\324<\254R\000\275\002\276#>\350Vt=E\005-\274\021\276\345\275\376\222\213\274\353\247\353\275\300\333\342;.i\251>\323\364\213<Y\366\'\2765\322\">[\372\213=Xs\t=c\257\023=\030,\267\274\337\274\006=\255w\375=\250g\024\275\001?\364\275\035;\367<\306N\206\276\233\2533>L\233\003\276\030y <\361\0205=\354\021$>\352\320\365\275\371G\272\275\316\200\024\276\227\324\313\2757\030\255\275C~\216\275\237\246\023>3\335]\275v\2403<\251:\225>x\\ >\3124l\276\240\343\225<\"$(<Cq\315>\332\310\301\275$\014\037>W\002\216\275\272C\223:\n2L=\035\376Y\273cY@=h\206\'\276\355\004\257\275~\377\342<\235\272C>\333\367?=\313\325)\276\376`\243\276\010\307\200>\274\334T\275\3533\225\275\362\316\217=l\000%\276\223\334b\276\325r3>G^h>_\273\"\273u\376\330=\216\256\271\275\300r\t\276\370o\351\274vQ\033\275\020\202\370=m\242~>\317\304\t>n\256b\275\001!\260\274\303(\304=\344\245-=\023\244\261\275\320\316\277=u<R\275\242\223\300\274J\034>=\035\230\027>\316\334\002\275oj\231>\006\211 \274\200\270\017\276\263\\\217=\234\333\350;\370/\031>\306\234V\275\0258\260\275\323\324!\276]\236Z=\274zg=\234\326\342\274V\300\233=@\007\255\274E\215*\275\033\202+\275@<\336\275qx\203=\324Or>L\356\265\276\324ay\275\026\'\010\275j\241E\275\006\307\212\275\263\351\031<\313q\220=\374\025\342\274\254\354\301=\006c\342=v\014\213=\210\232 \276\353\016\332\273\261\333\025\275\216\234D\276\303\022\302;h>\027\276-\240\036\276EO\273=\263\264\363<C\230\222\275[\205\210\276\264\235j\276s\262\315=\214hc=\260\273)\276\365{\004=\210T\034\276;\013\202=\211\321\033=\250P\206>\035\274=\274Gz\026\275C\200\275\275!\310\n\276=\371\206=\316E\217>\272\337\315=VO\250\275|\262\212;UN\310\275U@\264\275\013f\300\274\236\030\350<\336~\006\274\247\361E\276)\335\211\275\370\010\017>9]\200\275wR\373\275\"\376r>\336\3139\276`\267\333\274Iqw\273\222\014\023\275\2108/=\362!\021=\273\351\232\275T\273\204\276\350\364:=\026\300\262\275-P\203<g\313R\275L\332\300=\035\233\262=\234-\267>L\334\r>\324\001\010\276\000J\371=\2712w=\024V\336\275\306-b=&\336\010>@\256\205=\007\326\007\274\013\220E>\310\342r=\327e~\275\007\234$>H\203\211=\375,\004=2\342\274=I\236K\274\3051)=aV\033\276\225R\270\273L\025t=\314\2651\275e\037D\276\r\223\255=:\251b\276\247\374\237=\357\201#\275=t1\275\356yb\276\244n|<\317\357\211=\3073\'\276\3022r;\301\201*\276fV\322\275\201\371\263\275\307%\017>\3754\305=\202#\300=\203\206A\275\263\222\300\275\356\321\331\275S\303\326\276.x\032;5Y\300=\255\224\024\275\345\217\021>X\224)\275\361\251c=0\2455>Ln\357\275\201\351(\276s\027\267=\310\215\250>G\243W\274\373\264H>\306*\223>\017\273\177\274\211\025\215\275p\260\210\274\312^\356\275\023\242\004=T\036\206\276\363\247\354\275\353\2465=\225_\335:\032\215\354\2754\025\340\275\362^@\275\361&\217\275di$>[\035\n\276\274]\r\276]\323H>\020\333\365\273A\336@\276\207\r\311;\206\211\355\275\021\362\023\2758\\\342\275v\016\203\2750$\243=6#\034\275\2628!\276\037\344\375\275\205A\372=\022>\221\275\336Lm\276D\302\001\274\330L#\276\364\224+\276\340\266\201\273\005\270\255=\037\234\023=\301\232\202\276\327\021t;W\300s=\014\347\030=!P\024>e\231i\274\215\377\252=!\317\'\276!\021\230<k\240\207=\223|\025>\276\001\301\275[\2535=\323\220:>H3(>\223\t|>\007\355$\276g\352\374=F&X\275\332\234\"=T~\254>\201\345\314\275\330\312F\274\322\263\326=\377c\345<\314\265\351<*\241\204>\2733\202\274lp\227\275\340`T>\363\231\214\275\241eu>/?\303=\332\261\331\275g\326\366\275o:\377=\363\350\275\273XgE\275\033\367v\274\215\366\n\276\214*\205>!X\305\275\306\306{>\033\370N\276h\313\332\275p\314\276\276\325<\020\276\356?j\276\214=\032\273h\024\252=\014\224\006=f5M\276\0336\226=\003\211\217\275G\000\357=\271\243\032=\031\312W=\332\000\245=\347\222\305\274\242\231l\275t\226Z<\220\250*=\340h\304\274\271,\205=WQ\003=\311\353\323=yKw\273\270\372m\275\222\274\223\275\330rG=Ej*\275\333\210\270\275Ir\302\275\332\000\343=\270\0028<\t\223\340\275\003\375S\275o\205\355=\236$\264=\2065<\276<\000i\275YF\230\274\316O\230>u\301\035\276Q\212\202>\223\244\351\272f\210b=I\330\002\276\177\364\031>\207\301g\274\004\344\213\272\206\276\255;+7\003\276:G\273=X\210K\275\200\230\203=:d\363=R\"d=R\0357>\021\020\031>x\265\321\275\312\345U>0\014\301=\251\301$\275\rI\025=\373\005m\274\\\214Q\276\200#\345=\202~\320\275\200\013\301\275@\251\001>\347\330\365\274\037\256\\={+X>\337\200\363=\035\355\302<\251\022\016\275F\326\211\275\243\241\232=\2671\250\274|\301\205\276\317\013\307\274\332\226\345=\3005>\276\210$\201\275\335\341_=\342\314M\276\202|\312=\234\223F\276]r.\274e\033\\\276v4\202:\334\366\260\276V\'\030=\206fe\276\250\207\303=\210\235\241=S\217\216<\247c/=\356\005\232<*]\237=V,F\276\020\177\300=Iq\212>W\022\035>\366|\034>I\007\">\033\254\210\274\346\247K=\335.\204\276\256\300M>,\025\021\275\361\277\326<\353t\177\273\'Jf\2765;g<D\212\277\275.\370\'\275T\033\300\274\036\001\201=\240\267)>\360\363+\275B\351>\275u\275\244\274\376\372\201\274\355\364\260\275\016\214\222=&\246\213\276\026\010\233\275\341\247a\276\036\311\r;\207\236\016\276T\024Y\274\316\036\302=\0038\303\274\350<&\274\344\317{\274Ji\344\274Q\211\301>\310\226\256< \004\341=\363\311\205>\320\322k\274\245\335\372<Zk9\276a,\327:\235\344?\275\253\217\372\273\234|c>a\307\234\275I\262\251=<4\001<\201X\311\275\2503\254=|m%\275\205:\"=\305^\227=;\0075\276M\211\003>G\344o>N{=>+i\250=(io=t\027\027>yc\303=\271\373\207\275\341A\226\276\303\224m\275\276\003\221\274j\241\304\274\220\331\253\276z=\226\275\215\212v=4$\375\275\265i*\275\323<\003=1\225\220<9\353<;{\324u\274\037J\263\275\321\277\302\267\346\313\310>\035\005\327<\177\355\243\274+\301\354=X\352\256\274\215\341\373\275[+j\275\256\345}>\025\316\273\275Y\265\257\275\016\r\222\275\227\356\362\275!\254\211\275\240\rU\276\344\213\210<\302\035\333\275\344\267\033>?\365\200\274\343\370\267\275\302v\307<\276\362\t>\333p\n\276\033f\376<\021\225\005<m\'B\276t\241\005\276\013\023\002>_|\017\274iE\320\275\001|h>\344n>>\324T\363\275\253\262\256=s\330\021>@N\007>\325\272\236>t\255\025>\202\225\362\273\0263\361=\346\365>=j_\017=\330\\\003\275c\263\025\276\257\254\003>\\G\2749sc\n>\217i\027>\026\333U=\3523\251\274\304\215\371\275\305\317\300=\337\217\273<\343\\)=\r\374z\274G\226*\274\202\277\207\276\232\312\265\274*\221\220\274Z\252\327\275\226y\375\275\341\262\\=\022)\305\274mt/=\247\013\357\275(\016\006>\2617\211>\343\2161\274\030S\325=\225[\201\275\'B\304\275\346\255$\275\265\331\361={\257*>i\017\334\275)5\324;\034\264\360\274\033\350Z>\201%\006\276p\361\203\274\r\245\371\274\006\177_>\367<\242>\302\340\001\276\322\245.\275\235q\035>rks>\r\250\375\275}\347\335;u]\220<\354\005\331\274:s\317\276\241\350\031\276_=\217=\014o\263<m\343~>\"\364\000>\375\225 >i\254\200<\336,\314\275\nE\200;\013\003->\340\311-=Ow{=\322\301b\275\345\220\221\273E\305\224=]\033\333\275|\222\213=\314\253/;\271\005\217\275\256\344\272\275m\217@\275S7k=T4\361<\372\206(>\251#\252\275\226`\274=y\254\007\275\201\205Q=\332\323R>x1\276\275O\344R>\276\023\303\276X4\271\275\273\351\010>\224\020\345\275\225\246\270;\352f\246;\023\322\024\276\250{\023>~\204\207>\207\313\273\274U2\317\275q?\220\275\342\326\366<6\030\222=s\372\t\2765\rW\272 \022Z\276d\315k\275\253\376\204\275F\373\026>\372b\357\275\314\241\204=fg\034\276\202\254:\276\366\302\005>\255^W>Z_\203=/&P\275\377g\266\275\305\227\000>\304\033=\274\014\321|\275\017}=<1\350\367=\031J\342=\224\233\216\275\245\2625\274O\210\253\275\360\201\237>j\0100\276X\272\237=\226\\\252<\377\207W\276\212\270\232<\321\230J\276\227\033\001\275\027\305B\276\226\357m>\305\253\341\273\223\360)\2769\304*>\235\336\202>\267\351\361\274\010\0021\276\241\363v=\230Yj\276\225\353h\273\025\277\335\275\023\241u\274\216\240r\274\207W\327=\252\367~>\010\372\212\274%\002A<\215?\301\272\037\177\027\276\344\305D=\327r\">\363K>>\362#o=T\250\003\276\351-\316\275}\277u\275\234\005S=i\220\025=\237\263\271\275*I\177\275/L\254=\347\227z=#\032\251\275\300\250]\274c\203\262=~\r\352\275\323Y\207\275\234n\326=K\014\352\275R\365\205<\316\2071=\260)\037\276\316\035\373\275\022\246C>-\321\275\275nr\000\276\2415\341=<n\327=\n\327\205=\301\302\003>\210\021&=\345\213\223\275\342\261\321>\250\021D\2769F\001=\224\nj\276\331(}=F\201\330\274\\Y\325=b\354f\274C\324D\276\301\2555=\005G\203\276\0149N=\320<\334=\376\022\035\276\335s\003=\234\341S=7\264\267=\324^J>\271\230!=\212\224\">\327\367\245=\371\037\007=f\211\267<\311\231\251\275\271.\272=\310\263\001\276c_l>0\033\310\275\365}[=\035\325\321\273\230\246\244\275\213\361\016>o\300\325\274\321gl\276Q\252\025>\215G\265=V\350\222\275<m\224\275\362\345*=\247tT\276\217\"\026\276\'\233\202>R\252\274\275\363%f\276\204(\236>\235*\344\275\2067\253=\302\034\200=iB\354\274Z\257\313\274\361M\333<\226\337\220\275hsM\276\024\275f\273\207\237\212\276\261\316}=\034f\246<\t\301y=\'?\354\273\254x\250=\245\252\306=6\310I>\363\214@>\244J\001\276\020\264\330\271V\321\226\274\020\230\006\276=\0326=\224\022\004<\360F\204=\030\026 =\274\233\362\276\255\257\331;\374-\232\275>\373R\275^L\022=\3221\310=\233Y\020=\211\024\000=\272\n\340\274\340\'\202=-\340\006>.\336\376\275\257\367\311=\353\232\002;\244\200\266\271\201\244\302= ]4<JB]\274\27615>\345\200\314=4\003\234>M\216\345\275\226V\375\275\034\375\213>H\\\004\276\" \354<\246\233$>\250\254\243\273\365O\n>\332\346\t\276\243\334p\276t#\252=b,\275\275\367)\007\276z\267\233\273u#\274=\014<\031>\331a\375\275\347G\252\275\230s\372=\262\325\322=y\237\004\276#zu<\366^#\2754A\024\276\014\244\024>\261$\013>\rPN=cw\005<^\013\262;\2318l\2765\213\223=\367\254T=\266\250S>\261\343p=v\235O\275U\236\233\275\037\016\251\275\242\201\355\275\000\004\350<\303}\223\275V\254\224=\277X\022>c\203\304\275\301\207\177\276s-\242=\215w\006\275\270`==ap\275<[8\377\275\305\373\210\273{k1=\020\355\332\275J\372\037\274\234\275\376\272\032=H\276\007\360->i\251\244=\332\203\275\275\352yq=%_\243=\031\2408>A/\341=\315\335\033=\r\3555\276B\013\230=\211\000\013>\347\342 =\234\'l=\002\351\202\275/5\003\274Ia[\276\247\246`\276\375\363\267=\010`\360<\236\3413\275\000\246\270\276\031\206\362\275L\263e\274QM\271=\324Y(\276\205]\305<?,\013>\330\243\322\275\010\006\256>(W;>\257d\010=\250\350\204=\337D\220=\014k`\275\224\336\355:\230g\014\276?fe\276\332\025\217>xKm\275e&\202>\2666\n=N\212^>L\025\335=<~\276=\312])>\312\024\036\275\214\245\201<%\034\275=]\2107=\200_\205\275L\363\247<an\347\272\223\002$>\033)\227\276\217:\217;i\333q\276^\202\266;\254S\320\274\234\001\245\275z\274\347\275\364X\357<yz]\275\337\352\037\274_\366r\275Z>\312\275\021\335a\275=\306\222\275\350\341\350=\275\000\014>\007\016R\275\266w\356=<\262w\275\210\007\205=J\2234\276%o\265=\215Q\014\275p\215}=_\213\264\274\\-\203=*c_=\333\022\200>\376\263==\r\036;>x\010\002\275\333-\204=\265\n+=\317\206\"=\033S#=\343\312\034\276\331NX>7}1\276\300A(\275\324w\035>\017o\234\275\262\244\247=\240]\327\274g\352>\276#R\341>\"`+\276\245\314 \275e\266\311\275\223T\275<\253y\346\273\002\313\223\274\026`*=\235L;\276\026\216=\273M?\003>\314/\214\276\222\352\324=\226\240\313=O\276\360\275\304\022E\274\'\267u\275\342\307\203>\202\031\374\275%\013\204>\303\312%\276\305V\212\276\352\245h\275\323\355\003\276h\342\252\275\373\2054\2761l\026<)\204\363\275b~b>\377;#\276u\320q\275\311=K\276\353\333\321\2759\370\343\275c\332\013=\001\023\227<\203\0056=\277\362\006>\013\311\201>r0\224\273\257\007`=c}\311=\353\221\272=i\3437<&4,\276\215e\020\276\360\2671=\374\262\373=\357\004\222\275\210\312\306\274\323%\037>\331k\021>\021K(\275~\337\227=\016H\242\276\016\277P\2732\327\024\275\177\202\256\275\345-\323=\2148\203\275#$\327<\260V\323=\327\323\203\275N/\365=\362\035\206>\'\r&\275\023\366\332=\2007\035<U\263\n<\225\211\223>\311BQ>\275L\244<\307\177\306\275\221a\276\274B\202?=H\253\372=\203\023\240\273\020\227\231=\300=N>a\332\237\275V\367\342=\344\362\322=/Ek>\001.G\274`\317A\276\256^\300=\267f\306=\242\210\242\273\317\314\355;q\3243\272 \301*>/\372k\276>F\376<\201\221\322=\217a\017>\350\2434\274\241\031H\274\321:\006;\3431\234\275\275\357\340\275vZ\031\274\256\217\220\275}\373G<~\001\250\274\322\267\006=\003\"\372\275V+M>y\004\373=\234\251\016<}YR>o\372P>\013%\362<\257\266>\275g\211\220\276\033\330\006\276\014a\250\275\371\210\013>\010\227\246>\005\227\037>pv3\275\352\313e\275\270\221\356=\325\225\352<\271\266\262\275\236\226\273\275\237do\276\016\270\014\276\313\227%>\244\030,\27629\201\276\316\014\342\275E\363M>\270\032\221>\305\206[\275\367&\303:\363\321U\275\274\333\255\274\342!\305\275\252];>uwE\275\374\373C=}r\206\275mB\234\274\355\301\221\274\261\241%\276d\027\265\275\267CK>D\343(\276\260\330\037>?\344I>\314\031\t\275\334\232;\276#\215E\275\360\037\207\274}l\211=\330t%\276\265g\024\276\210\251\217\276\027kx\2751\313\346\274r\353\256=h\264$\275\300\234\235\275\271>\361=\225\377\343<\324\356c\275\333\356\263;\265(D>\272-\323=\320\024;>9b\217\275-\263W\276\2742t=\233\256\316\275\201\232D<>\036\377=\3668\346\274\341_$\276\231\201\036>?\276\265\275\373\334\242=\213\003\262=\331\014\000>\371\307\213\274^\021\224\276B\303\252\275@\224i=\322\330\004\276L\013,>\232c\344=\364Cb=\225\214K\275\027v\207\276\346\330\355=7\263\216=K\231\322\273B\257\334\275\274x<\273un\376\275\355\232p=\265?M\275?\364\217\276;\361\337\275\260\224\243;\357i\377\275N\242\305=\354\\+>\214i\305<\364\030{=\211\3436<\270\301c\275\037o3=\0107\215=b,H;\334\310\n>d\254\266\275F\025\206\276\204oC\276N0\014\275\213\277S>\314\224\217\273\334u/=\016\366M\2763\277\340\274\001%e>\273V\341\275\303\306\326\274!\233,>\333W\257\276u\331D\274?~\201\275*\225\203<q\204d\276\354S\317\275\267\021Y=\330\325\250\275\325\261\373\275A\256\316=\031\346\321\275Q)\246\275]<w\275\335\364\332<"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
